Zephyr4Microchip/microchip-hal/packs/pic32c/pic32ck_sg_gc/common/sdhc_pic32ck_sg_gc.h
/*
 * Copyright (c) 2026 Microchip Technology Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 */

/**
 * @file sdhc_pic32ck_sg_gc.h
 * @brief Generic SDHC register mappings for PIC32CK SG/GC family.
 *
 * This file defines generic register mappings of SDHC registers
 * on Microchip PIC32CK_SG_GC devices. These macros map SDHC_
 * names (used by the driver) to SDMMC_ names (used by PIC32CK hardware).
 */

#ifndef MICROCHIP_COMMON_SDHC_PIC32CK_SG_GC_H_
#define MICROCHIP_COMMON_SDHC_PIC32CK_SG_GC_H_

/* Register type mapping */
typedef sdmmc_registers_t sdhc_registers_t;

/*
 * SDHC_SSAR : (SDMMC Offset: 0x00) (R/W 32) SDMA System Address / Argument 2
 */
#define SDHC_SSAR_RESETVALUE SDMMC_SSAR_RESETVALUE

#define SDHC_SSAR_ADDR_Pos SDMMC_SSAR_ADDR_Pos
#define SDHC_SSAR_ADDR_Msk SDMMC_SSAR_ADDR_Msk
#define SDHC_SSAR_ADDR(value) SDMMC_SSAR_ADDR(value)
#define SDHC_SSAR_Msk SDMMC_SSAR_Msk

/* CMD23 mode */
#define SDHC_SSAR_CMD23_ARG2_Pos SDMMC_SSAR_CMD23_ARG2_Pos
#define SDHC_SSAR_CMD23_ARG2_Msk SDMMC_SSAR_CMD23_ARG2_Msk
#define SDHC_SSAR_CMD23_ARG2(value) SDMMC_SSAR_CMD23_ARG2(value)
#define SDHC_SSAR_CMD23_Msk SDMMC_SSAR_CMD23_Msk

/* SDHC_BSR : (SDMMC Offset: 0x04) (R/W 16) Block Size */
#define SDHC_BSR_RESETVALUE SDMMC_BSR_RESETVALUE

#define SDHC_BSR_BLOCKSIZE_Pos SDMMC_BSR_BLOCKSIZE_Pos
#define SDHC_BSR_BLOCKSIZE_Msk SDMMC_BSR_BLOCKSIZE_Msk
#define SDHC_BSR_BLOCKSIZE(value) SDMMC_BSR_BLOCKSIZE(value)
#define SDHC_BSR_BOUNDARY_Pos SDMMC_BSR_BOUNDARY_Pos
#define SDHC_BSR_BOUNDARY_Msk SDMMC_BSR_BOUNDARY_Msk
#define SDHC_BSR_BOUNDARY(value) SDMMC_BSR_BOUNDARY(value)
#define SDHC_BSR_BOUNDARY_4K_Val SDMMC_BSR_BOUNDARY_4K_Val
#define SDHC_BSR_BOUNDARY_8K_Val SDMMC_BSR_BOUNDARY_8K_Val
#define SDHC_BSR_BOUNDARY_16K_Val SDMMC_BSR_BOUNDARY_16K_Val
#define SDHC_BSR_BOUNDARY_32K_Val SDMMC_BSR_BOUNDARY_32K_Val
#define SDHC_BSR_BOUNDARY_64K_Val SDMMC_BSR_BOUNDARY_64K_Val
#define SDHC_BSR_BOUNDARY_128K_Val SDMMC_BSR_BOUNDARY_128K_Val
#define SDHC_BSR_BOUNDARY_256K_Val SDMMC_BSR_BOUNDARY_256K_Val
#define SDHC_BSR_BOUNDARY_512K_Val SDMMC_BSR_BOUNDARY_512K_Val
#define SDHC_BSR_BOUNDARY_4K SDMMC_BSR_BOUNDARY_4K
#define SDHC_BSR_BOUNDARY_8K SDMMC_BSR_BOUNDARY_8K
#define SDHC_BSR_BOUNDARY_16K SDMMC_BSR_BOUNDARY_16K
#define SDHC_BSR_BOUNDARY_32K SDMMC_BSR_BOUNDARY_32K
#define SDHC_BSR_BOUNDARY_64K SDMMC_BSR_BOUNDARY_64K
#define SDHC_BSR_BOUNDARY_128K SDMMC_BSR_BOUNDARY_128K
#define SDHC_BSR_BOUNDARY_256K SDMMC_BSR_BOUNDARY_256K
#define SDHC_BSR_BOUNDARY_512K SDMMC_BSR_BOUNDARY_512K
#define SDHC_BSR_Msk SDMMC_BSR_Msk

/* SDHC_BCR : (SDMMC Offset: 0x06) (R/W 16) Block Count */
#define SDHC_BCR_RESETVALUE SDMMC_BCR_RESETVALUE

#define SDHC_BCR_BCNT_Pos SDMMC_BCR_BCNT_Pos
#define SDHC_BCR_BCNT_Msk SDMMC_BCR_BCNT_Msk
#define SDHC_BCR_BCNT(value) SDMMC_BCR_BCNT(value)
#define SDHC_BCR_Msk SDMMC_BCR_Msk

/* SDHC_ARG1R : (SDMMC Offset: 0x08) (R/W 32) Argument 1 */
#define SDHC_ARG1R_RESETVALUE SDMMC_ARG1R_RESETVALUE

#define SDHC_ARG1R_ARG_Pos SDMMC_ARG1R_ARG_Pos
#define SDHC_ARG1R_ARG_Msk SDMMC_ARG1R_ARG_Msk
#define SDHC_ARG1R_ARG(value) SDMMC_ARG1R_ARG(value)
#define SDHC_ARG1R_Msk SDMMC_ARG1R_Msk

/* SDHC_TMR : (SDMMC Offset: 0x0C) (R/W 16) Transfer Mode */
#define SDHC_TMR_RESETVALUE SDMMC_TMR_RESETVALUE

#define SDHC_TMR_DMAEN_Pos SDMMC_TMR_DMAEN_Pos
#define SDHC_TMR_DMAEN_Msk SDMMC_TMR_DMAEN_Msk
#define SDHC_TMR_DMAEN(value) SDMMC_TMR_DMAEN(value)
#define SDHC_TMR_DMAEN_DISABLE_Val SDMMC_TMR_DMAEN_DISABLE_Val
#define SDHC_TMR_DMAEN_ENABLE_Val SDMMC_TMR_DMAEN_ENABLE_Val
#define SDHC_TMR_DMAEN_DISABLE SDMMC_TMR_DMAEN_DISABLE
#define SDHC_TMR_DMAEN_ENABLE SDMMC_TMR_DMAEN_ENABLE
#define SDHC_TMR_BCEN_Pos SDMMC_TMR_BCEN_Pos
#define SDHC_TMR_BCEN_Msk SDMMC_TMR_BCEN_Msk
#define SDHC_TMR_BCEN(value) SDMMC_TMR_BCEN(value)
#define SDHC_TMR_BCEN_DISABLE_Val SDMMC_TMR_BCEN_DISABLE_Val
#define SDHC_TMR_BCEN_ENABLE_Val SDMMC_TMR_BCEN_ENABLE_Val
#define SDHC_TMR_BCEN_DISABLE SDMMC_TMR_BCEN_DISABLE
#define SDHC_TMR_BCEN_ENABLE SDMMC_TMR_BCEN_ENABLE
#define SDHC_TMR_ACMDEN_Pos SDMMC_TMR_ACMDEN_Pos
#define SDHC_TMR_ACMDEN_Msk SDMMC_TMR_ACMDEN_Msk
#define SDHC_TMR_ACMDEN(value) SDMMC_TMR_ACMDEN(value)
#define SDHC_TMR_ACMDEN_DISABLED_Val SDMMC_TMR_ACMDEN_DISABLED_Val
#define SDHC_TMR_ACMDEN_CMD12_Val SDMMC_TMR_ACMDEN_CMD12_Val
#define SDHC_TMR_ACMDEN_CMD23_Val SDMMC_TMR_ACMDEN_CMD23_Val
#define SDHC_TMR_ACMDEN_DISABLED SDMMC_TMR_ACMDEN_DISABLED
#define SDHC_TMR_ACMDEN_CMD12 SDMMC_TMR_ACMDEN_CMD12
#define SDHC_TMR_ACMDEN_CMD23 SDMMC_TMR_ACMDEN_CMD23
#define SDHC_TMR_DTDSEL_Pos SDMMC_TMR_DTDSEL_Pos
#define SDHC_TMR_DTDSEL_Msk SDMMC_TMR_DTDSEL_Msk
#define SDHC_TMR_DTDSEL(value) SDMMC_TMR_DTDSEL(value)
#define SDHC_TMR_DTDSEL_WRITE_Val SDMMC_TMR_DTDSEL_WRITE_Val
#define SDHC_TMR_DTDSEL_READ_Val SDMMC_TMR_DTDSEL_READ_Val
#define SDHC_TMR_DTDSEL_WRITE SDMMC_TMR_DTDSEL_WRITE
#define SDHC_TMR_DTDSEL_READ SDMMC_TMR_DTDSEL_READ
#define SDHC_TMR_MSBSEL_Pos SDMMC_TMR_MSBSEL_Pos
#define SDHC_TMR_MSBSEL_Msk SDMMC_TMR_MSBSEL_Msk
#define SDHC_TMR_MSBSEL(value) SDMMC_TMR_MSBSEL(value)
#define SDHC_TMR_MSBSEL_SINGLE_Val SDMMC_TMR_MSBSEL_SINGLE_Val
#define SDHC_TMR_MSBSEL_MULTIPLE_Val SDMMC_TMR_MSBSEL_MULTIPLE_Val
#define SDHC_TMR_MSBSEL_SINGLE SDMMC_TMR_MSBSEL_SINGLE
#define SDHC_TMR_MSBSEL_MULTIPLE SDMMC_TMR_MSBSEL_MULTIPLE
#define SDHC_TMR_Msk SDMMC_TMR_Msk

/* SDHC_CR : (SDMMC Offset: 0x0E) (R/W 16) Command */
#define SDHC_CR_RESETVALUE SDMMC_CR_RESETVALUE

#define SDHC_CR_RESPTYP_Pos SDMMC_CR_RESPTYP_Pos
#define SDHC_CR_RESPTYP_Msk SDMMC_CR_RESPTYP_Msk
#define SDHC_CR_RESPTYP(value) SDMMC_CR_RESPTYP(value)
#define SDHC_CR_RESPTYP_NONE_Val SDMMC_CR_RESPTYP_NONE_Val
#define SDHC_CR_RESPTYP_136_BIT_Val SDMMC_CR_RESPTYP_136_BIT_Val
#define SDHC_CR_RESPTYP_48_BIT_Val SDMMC_CR_RESPTYP_48_BIT_Val
#define SDHC_CR_RESPTYP_48_BIT_BUSY_Val SDMMC_CR_RESPTYP_48_BIT_BUSY_Val
#define SDHC_CR_RESPTYP_NONE SDMMC_CR_RESPTYP_NONE
#define SDHC_CR_RESPTYP_136_BIT SDMMC_CR_RESPTYP_136_BIT
#define SDHC_CR_RESPTYP_48_BIT SDMMC_CR_RESPTYP_48_BIT
#define SDHC_CR_RESPTYP_48_BIT_BUSY SDMMC_CR_RESPTYP_48_BIT_BUSY
#define SDHC_CR_CMDCCEN_Pos SDMMC_CR_CMDCCEN_Pos
#define SDHC_CR_CMDCCEN_Msk SDMMC_CR_CMDCCEN_Msk
#define SDHC_CR_CMDCCEN(value) SDMMC_CR_CMDCCEN(value)
#define SDHC_CR_CMDCCEN_DISABLE_Val SDMMC_CR_CMDCCEN_DISABLE_Val
#define SDHC_CR_CMDCCEN_ENABLE_Val SDMMC_CR_CMDCCEN_ENABLE_Val
#define SDHC_CR_CMDCCEN_DISABLE SDMMC_CR_CMDCCEN_DISABLE
#define SDHC_CR_CMDCCEN_ENABLE SDMMC_CR_CMDCCEN_ENABLE
#define SDHC_CR_CMDICEN_Pos SDMMC_CR_CMDICEN_Pos
#define SDHC_CR_CMDICEN_Msk SDMMC_CR_CMDICEN_Msk
#define SDHC_CR_CMDICEN(value) SDMMC_CR_CMDICEN(value)
#define SDHC_CR_CMDICEN_DISABLE_Val SDMMC_CR_CMDICEN_DISABLE_Val
#define SDHC_CR_CMDICEN_ENABLE_Val SDMMC_CR_CMDICEN_ENABLE_Val
#define SDHC_CR_CMDICEN_DISABLE SDMMC_CR_CMDICEN_DISABLE
#define SDHC_CR_CMDICEN_ENABLE SDMMC_CR_CMDICEN_ENABLE
#define SDHC_CR_DPSEL_Pos SDMMC_CR_DPSEL_Pos
#define SDHC_CR_DPSEL_Msk SDMMC_CR_DPSEL_Msk
#define SDHC_CR_DPSEL(value) SDMMC_CR_DPSEL(value)
#define SDHC_CR_DPSEL_NO_DATA_Val SDMMC_CR_DPSEL_NO_DATA_Val
#define SDHC_CR_DPSEL_DATA_Val SDMMC_CR_DPSEL_DATA_Val
#define SDHC_CR_DPSEL_NO_DATA SDMMC_CR_DPSEL_NO_DATA
#define SDHC_CR_DPSEL_DATA SDMMC_CR_DPSEL_DATA
#define SDHC_CR_CMDTYP_Pos SDMMC_CR_CMDTYP_Pos
#define SDHC_CR_CMDTYP_Msk SDMMC_CR_CMDTYP_Msk
#define SDHC_CR_CMDTYP(value) SDMMC_CR_CMDTYP(value)
#define SDHC_CR_CMDTYP_NORMAL_Val SDMMC_CR_CMDTYP_NORMAL_Val
#define SDHC_CR_CMDTYP_SUSPEND_Val SDMMC_CR_CMDTYP_SUSPEND_Val
#define SDHC_CR_CMDTYP_RESUME_Val SDMMC_CR_CMDTYP_RESUME_Val
#define SDHC_CR_CMDTYP_ABORT_Val SDMMC_CR_CMDTYP_ABORT_Val
#define SDHC_CR_CMDTYP_NORMAL SDMMC_CR_CMDTYP_NORMAL
#define SDHC_CR_CMDTYP_SUSPEND SDMMC_CR_CMDTYP_SUSPEND
#define SDHC_CR_CMDTYP_RESUME SDMMC_CR_CMDTYP_RESUME
#define SDHC_CR_CMDTYP_ABORT SDMMC_CR_CMDTYP_ABORT
#define SDHC_CR_CMDIDX_Pos SDMMC_CR_CMDIDX_Pos
#define SDHC_CR_CMDIDX_Msk SDMMC_CR_CMDIDX_Msk
#define SDHC_CR_CMDIDX(value) SDMMC_CR_CMDIDX(value)
#define SDHC_CR_Msk SDMMC_CR_Msk

/* SDHC_RR : (SDMMC Offset: 0x10) ( R/ 32) Response */
#define SDHC_RR_RESETVALUE SDMMC_RR_RESETVALUE

