Zephyr4Microchip/microchip-hal/packs/pic32c/pic32ck_sg_gc/common/sdhc_pic32ck_sg_gc.h
#define SDHC_RR_CMDRESP_Pos SDMMC_RR_CMDRESP_Pos
#define SDHC_RR_CMDRESP_Msk SDMMC_RR_CMDRESP_Msk
#define SDHC_RR_CMDRESP(value) SDMMC_RR_CMDRESP(value)
#define SDHC_RR_Msk SDMMC_RR_Msk

/* SDHC_BDPR : (SDMMC Offset: 0x20) (R/W 32) Buffer Data Port */
#define SDHC_BDPR_RESETVALUE SDMMC_BDPR_RESETVALUE

#define SDHC_BDPR_BUFDATA_Pos SDMMC_BDPR_BUFDATA_Pos
#define SDHC_BDPR_BUFDATA_Msk SDMMC_BDPR_BUFDATA_Msk
#define SDHC_BDPR_BUFDATA(value) SDMMC_BDPR_BUFDATA(value)
#define SDHC_BDPR_Msk SDMMC_BDPR_Msk

/* SDHC_PSR : (SDMMC Offset: 0x24) ( R/ 32) Present State */
#define SDHC_PSR_RESETVALUE SDMMC_PSR_RESETVALUE

#define SDHC_PSR_CMDINHC_Pos SDMMC_PSR_CMDINHC_Pos
#define SDHC_PSR_CMDINHC_Msk SDMMC_PSR_CMDINHC_Msk
#define SDHC_PSR_CMDINHC(value) SDMMC_PSR_CMDINHC(value)
#define SDHC_PSR_CMDINHC_CAN_Val SDMMC_PSR_CMDINHC_CAN_Val
#define SDHC_PSR_CMDINHC_CANNOT_Val SDMMC_PSR_CMDINHC_CANNOT_Val
#define SDHC_PSR_CMDINHC_CAN SDMMC_PSR_CMDINHC_CAN
#define SDHC_PSR_CMDINHC_CANNOT SDMMC_PSR_CMDINHC_CANNOT
#define SDHC_PSR_CMDINHD_Pos SDMMC_PSR_CMDINHD_Pos
#define SDHC_PSR_CMDINHD_Msk SDMMC_PSR_CMDINHD_Msk
#define SDHC_PSR_CMDINHD(value) SDMMC_PSR_CMDINHD(value)
#define SDHC_PSR_CMDINHD_CAN_Val SDMMC_PSR_CMDINHD_CAN_Val
#define SDHC_PSR_CMDINHD_CANNOT_Val SDMMC_PSR_CMDINHD_CANNOT_Val
#define SDHC_PSR_CMDINHD_CAN SDMMC_PSR_CMDINHD_CAN
#define SDHC_PSR_CMDINHD_CANNOT SDMMC_PSR_CMDINHD_CANNOT
#define SDHC_PSR_DLACT_Pos SDMMC_PSR_DLACT_Pos
#define SDHC_PSR_DLACT_Msk SDMMC_PSR_DLACT_Msk
#define SDHC_PSR_DLACT(value) SDMMC_PSR_DLACT(value)
#define SDHC_PSR_DLACT_INACTIVE_Val SDMMC_PSR_DLACT_INACTIVE_Val
#define SDHC_PSR_DLACT_ACTIVE_Val SDMMC_PSR_DLACT_ACTIVE_Val
#define SDHC_PSR_DLACT_INACTIVE SDMMC_PSR_DLACT_INACTIVE
#define SDHC_PSR_DLACT_ACTIVE SDMMC_PSR_DLACT_ACTIVE
#define SDHC_PSR_RTREQ_Pos SDMMC_PSR_RTREQ_Pos
#define SDHC_PSR_RTREQ_Msk SDMMC_PSR_RTREQ_Msk
#define SDHC_PSR_RTREQ(value) SDMMC_PSR_RTREQ(value)
#define SDHC_PSR_RTREQ_OK_Val SDMMC_PSR_RTREQ_OK_Val
#define SDHC_PSR_RTREQ_REQUIRED_Val SDMMC_PSR_RTREQ_REQUIRED_Val
#define SDHC_PSR_RTREQ_OK SDMMC_PSR_RTREQ_OK
#define SDHC_PSR_RTREQ_REQUIRED SDMMC_PSR_RTREQ_REQUIRED
#define SDHC_PSR_WTACT_Pos SDMMC_PSR_WTACT_Pos
#define SDHC_PSR_WTACT_Msk SDMMC_PSR_WTACT_Msk
#define SDHC_PSR_WTACT(value) SDMMC_PSR_WTACT(value)
#define SDHC_PSR_WTACT_NO_Val SDMMC_PSR_WTACT_NO_Val
#define SDHC_PSR_WTACT_YES_Val SDMMC_PSR_WTACT_YES_Val
#define SDHC_PSR_WTACT_NO SDMMC_PSR_WTACT_NO
#define SDHC_PSR_WTACT_YES SDMMC_PSR_WTACT_YES
#define SDHC_PSR_RTACT_Pos SDMMC_PSR_RTACT_Pos
#define SDHC_PSR_RTACT_Msk SDMMC_PSR_RTACT_Msk
#define SDHC_PSR_RTACT(value) SDMMC_PSR_RTACT(value)
#define SDHC_PSR_RTACT_NO_Val SDMMC_PSR_RTACT_NO_Val
#define SDHC_PSR_RTACT_YES_Val SDMMC_PSR_RTACT_YES_Val
#define SDHC_PSR_RTACT_NO SDMMC_PSR_RTACT_NO
#define SDHC_PSR_RTACT_YES SDMMC_PSR_RTACT_YES
#define SDHC_PSR_BUFWREN_Pos SDMMC_PSR_BUFWREN_Pos
#define SDHC_PSR_BUFWREN_Msk SDMMC_PSR_BUFWREN_Msk
#define SDHC_PSR_BUFWREN(value) SDMMC_PSR_BUFWREN(value)
#define SDHC_PSR_BUFWREN_DISABLE_Val SDMMC_PSR_BUFWREN_DISABLE_Val
#define SDHC_PSR_BUFWREN_ENABLE_Val SDMMC_PSR_BUFWREN_ENABLE_Val
#define SDHC_PSR_BUFWREN_DISABLE SDMMC_PSR_BUFWREN_DISABLE
#define SDHC_PSR_BUFWREN_ENABLE SDMMC_PSR_BUFWREN_ENABLE
#define SDHC_PSR_BUFRDEN_Pos SDMMC_PSR_BUFRDEN_Pos
#define SDHC_PSR_BUFRDEN_Msk SDMMC_PSR_BUFRDEN_Msk
#define SDHC_PSR_BUFRDEN(value) SDMMC_PSR_BUFRDEN(value)
#define SDHC_PSR_BUFRDEN_DISABLE_Val SDMMC_PSR_BUFRDEN_DISABLE_Val
#define SDHC_PSR_BUFRDEN_ENABLE_Val SDMMC_PSR_BUFRDEN_ENABLE_Val
#define SDHC_PSR_BUFRDEN_DISABLE SDMMC_PSR_BUFRDEN_DISABLE
#define SDHC_PSR_BUFRDEN_ENABLE SDMMC_PSR_BUFRDEN_ENABLE
#define SDHC_PSR_CARDINS_Pos SDMMC_PSR_CARDINS_Pos
#define SDHC_PSR_CARDINS_Msk SDMMC_PSR_CARDINS_Msk
#define SDHC_PSR_CARDINS(value) SDMMC_PSR_CARDINS(value)
#define SDHC_PSR_CARDINS_NO_Val SDMMC_PSR_CARDINS_NO_Val
#define SDHC_PSR_CARDINS_YES_Val SDMMC_PSR_CARDINS_YES_Val
#define SDHC_PSR_CARDINS_NO SDMMC_PSR_CARDINS_NO
#define SDHC_PSR_CARDINS_YES SDMMC_PSR_CARDINS_YES
#define SDHC_PSR_CARDSS_Pos SDMMC_PSR_CARDSS_Pos
#define SDHC_PSR_CARDSS_Msk SDMMC_PSR_CARDSS_Msk
#define SDHC_PSR_CARDSS(value) SDMMC_PSR_CARDSS(value)
#define SDHC_PSR_CARDSS_NO_Val SDMMC_PSR_CARDSS_NO_Val
#define SDHC_PSR_CARDSS_YES_Val SDMMC_PSR_CARDSS_YES_Val
#define SDHC_PSR_CARDSS_NO SDMMC_PSR_CARDSS_NO
#define SDHC_PSR_CARDSS_YES SDMMC_PSR_CARDSS_YES
#define SDHC_PSR_CARDDPL_Pos SDMMC_PSR_CARDDPL_Pos
#define SDHC_PSR_CARDDPL_Msk SDMMC_PSR_CARDDPL_Msk
#define SDHC_PSR_CARDDPL(value) SDMMC_PSR_CARDDPL(value)
#define SDHC_PSR_CARDDPL_NO_Val SDMMC_PSR_CARDDPL_NO_Val
#define SDHC_PSR_CARDDPL_YES_Val SDMMC_PSR_CARDDPL_YES_Val
#define SDHC_PSR_CARDDPL_NO SDMMC_PSR_CARDDPL_NO
#define SDHC_PSR_CARDDPL_YES SDMMC_PSR_CARDDPL_YES
#define SDHC_PSR_WRPPL_Pos SDMMC_PSR_WRPPL_Pos
#define SDHC_PSR_WRPPL_Msk SDMMC_PSR_WRPPL_Msk
#define SDHC_PSR_WRPPL(value) SDMMC_PSR_WRPPL(value)
#define SDHC_PSR_WRPPL_PROTECTED_Val SDMMC_PSR_WRPPL_PROTECTED_Val
#define SDHC_PSR_WRPPL_ENABLED_Val SDMMC_PSR_WRPPL_ENABLED_Val
#define SDHC_PSR_WRPPL_PROTECTED SDMMC_PSR_WRPPL_PROTECTED
#define SDHC_PSR_WRPPL_ENABLED SDMMC_PSR_WRPPL_ENABLED
#define SDHC_PSR_DATLL_Pos SDMMC_PSR_DATLL_Pos
#define SDHC_PSR_DATLL_Msk SDMMC_PSR_DATLL_Msk
#define SDHC_PSR_DATLL(value) SDMMC_PSR_DATLL(value)
#define SDHC_PSR_CMDLL_Pos SDMMC_PSR_CMDLL_Pos
#define SDHC_PSR_CMDLL_Msk SDMMC_PSR_CMDLL_Msk
#define SDHC_PSR_CMDLL(value) SDMMC_PSR_CMDLL(value)
#define SDHC_PSR_Msk SDMMC_PSR_Msk

/* SDHC_HC1R : (SDMMC Offset: 0x28) (R/W 8) Host Control 1 */
#define SDHC_HC1R_RESETVALUE SDMMC_HC1R_RESETVALUE

#define SDHC_HC1R_LEDCTRL_Pos SDMMC_HC1R_LEDCTRL_Pos
#define SDHC_HC1R_LEDCTRL_Msk SDMMC_HC1R_LEDCTRL_Msk
#define SDHC_HC1R_LEDCTRL(value) SDMMC_HC1R_LEDCTRL(value)
#define SDHC_HC1R_LEDCTRL_OFF_Val SDMMC_HC1R_LEDCTRL_OFF_Val
#define SDHC_HC1R_LEDCTRL_ON_Val SDMMC_HC1R_LEDCTRL_ON_Val
#define SDHC_HC1R_LEDCTRL_OFF SDMMC_HC1R_LEDCTRL_OFF
#define SDHC_HC1R_LEDCTRL_ON SDMMC_HC1R_LEDCTRL_ON
#define SDHC_HC1R_DW_Pos SDMMC_HC1R_DW_Pos
#define SDHC_HC1R_DW_Msk SDMMC_HC1R_DW_Msk
#define SDHC_HC1R_DW(value) SDMMC_HC1R_DW(value)
#define SDHC_HC1R_DW_1BIT_Val SDMMC_HC1R_DW_1BIT_Val
#define SDHC_HC1R_DW_4BIT_Val SDMMC_HC1R_DW_4BIT_Val
#define SDHC_HC1R_DW_1BIT SDMMC_HC1R_DW_1BIT
#define SDHC_HC1R_DW_4BIT SDMMC_HC1R_DW_4BIT
#define SDHC_HC1R_HSEN_Pos SDMMC_HC1R_HSEN_Pos
#define SDHC_HC1R_HSEN_Msk SDMMC_HC1R_HSEN_Msk
#define SDHC_HC1R_HSEN(value) SDMMC_HC1R_HSEN(value)
#define SDHC_HC1R_HSEN_NORMAL_Val SDMMC_HC1R_HSEN_NORMAL_Val
#define SDHC_HC1R_HSEN_HIGH_Val SDMMC_HC1R_HSEN_HIGH_Val
#define SDHC_HC1R_HSEN_NORMAL SDMMC_HC1R_HSEN_NORMAL
#define SDHC_HC1R_HSEN_HIGH SDMMC_HC1R_HSEN_HIGH
#define SDHC_HC1R_DMASEL_Pos SDMMC_HC1R_DMASEL_Pos
#define SDHC_HC1R_DMASEL_Msk SDMMC_HC1R_DMASEL_Msk
#define SDHC_HC1R_DMASEL(value) SDMMC_HC1R_DMASEL(value)
#define SDHC_HC1R_DMASEL_SDMA_Val SDMMC_HC1R_DMASEL_SDMA_Val
#define SDHC_HC1R_DMASEL_32BIT_Val SDMMC_HC1R_DMASEL_32BIT_Val
#define SDHC_HC1R_DMASEL_SDMA SDMMC_HC1R_DMASEL_SDMA
#define SDHC_HC1R_DMASEL_32BIT SDMMC_HC1R_DMASEL_32BIT
#define SDHC_HC1R_CARDDTL_Pos SDMMC_HC1R_CARDDTL_Pos
#define SDHC_HC1R_CARDDTL_Msk SDMMC_HC1R_CARDDTL_Msk
#define SDHC_HC1R_CARDDTL(value) SDMMC_HC1R_CARDDTL(value)
#define SDHC_HC1R_CARDDTL_NO_Val SDMMC_HC1R_CARDDTL_NO_Val
#define SDHC_HC1R_CARDDTL_YES_Val SDMMC_HC1R_CARDDTL_YES_Val
#define SDHC_HC1R_CARDDTL_NO SDMMC_HC1R_CARDDTL_NO
#define SDHC_HC1R_CARDDTL_YES SDMMC_HC1R_CARDDTL_YES
#define SDHC_HC1R_CARDDSEL_Pos SDMMC_HC1R_CARDDSEL_Pos
#define SDHC_HC1R_CARDDSEL_Msk SDMMC_HC1R_CARDDSEL_Msk
#define SDHC_HC1R_CARDDSEL(value) SDMMC_HC1R_CARDDSEL(value)
#define SDHC_HC1R_CARDDSEL_NORMAL_Val SDMMC_HC1R_CARDDSEL_NORMAL_Val
#define SDHC_HC1R_CARDDSEL_TEST_Val SDMMC_HC1R_CARDDSEL_TEST_Val
#define SDHC_HC1R_CARDDSEL_NORMAL SDMMC_HC1R_CARDDSEL_NORMAL
#define SDHC_HC1R_CARDDSEL_TEST SDMMC_HC1R_CARDDSEL_TEST
#define SDHC_HC1R_Msk SDMMC_HC1R_Msk

/* EMMC mode */
#define SDHC_HC1R_EMMC_Msk SDMMC_HC1R_EMMC_Msk

/* SDHC_PCR : (SDMMC Offset: 0x29) (R/W 8) Power Control */
#define SDHC_PCR_RESETVALUE SDMMC_PCR_RESETVALUE

#define SDHC_PCR_SDBPWR_Pos SDMMC_PCR_SDBPWR_Pos
#define SDHC_PCR_SDBPWR_Msk SDMMC_PCR_SDBPWR_Msk
#define SDHC_PCR_SDBPWR(value) SDMMC_PCR_SDBPWR(value)
#define SDHC_PCR_SDBPWR_OFF_Val SDMMC_PCR_SDBPWR_OFF_Val
#define SDHC_PCR_SDBPWR_ON_Val SDMMC_PCR_SDBPWR_ON_Val
#define SDHC_PCR_SDBPWR_OFF SDMMC_PCR_SDBPWR_OFF
#define SDHC_PCR_SDBPWR_ON SDMMC_PCR_SDBPWR_ON
#define SDHC_PCR_SDBVSEL_Pos SDMMC_PCR_SDBVSEL_Pos
#define SDHC_PCR_SDBVSEL_Msk SDMMC_PCR_SDBVSEL_Msk
#define SDHC_PCR_SDBVSEL(value) SDMMC_PCR_SDBVSEL(value)
#define SDHC_PCR_SDBVSEL_1V8_Val SDMMC_PCR_SDBVSEL_1V8_Val
#define SDHC_PCR_SDBVSEL_3V0_Val SDMMC_PCR_SDBVSEL_3V0_Val
#define SDHC_PCR_SDBVSEL_3V3_Val SDMMC_PCR_SDBVSEL_3V3_Val
#define SDHC_PCR_SDBVSEL_1V8 SDMMC_PCR_SDBVSEL_1V8
#define SDHC_PCR_SDBVSEL_3V0 SDMMC_PCR_SDBVSEL_3V0
#define SDHC_PCR_SDBVSEL_3V3 SDMMC_PCR_SDBVSEL_3V3
#define SDHC_PCR_Msk SDMMC_PCR_Msk

/* SDHC_BGCR : (SDMMC Offset: 0x2A) (R/W 8) Block Gap Control */
#define SDHC_BGCR_RESETVALUE SDMMC_BGCR_RESETVALUE

