Zephyr4Microchip/microchip-hal/packs/pic32c/pic32ck_sg_gc/common/sdhc_pic32ck_sg_gc.h
#define SDHC_BGCR_STPBGR_Pos SDMMC_BGCR_STPBGR_Pos
#define SDHC_BGCR_STPBGR_Msk SDMMC_BGCR_STPBGR_Msk
#define SDHC_BGCR_STPBGR(value) SDMMC_BGCR_STPBGR(value)
#define SDHC_BGCR_STPBGR_TRANSFER_Val SDMMC_BGCR_STPBGR_TRANSFER_Val
#define SDHC_BGCR_STPBGR_STOP_Val SDMMC_BGCR_STPBGR_STOP_Val
#define SDHC_BGCR_STPBGR_TRANSFER SDMMC_BGCR_STPBGR_TRANSFER
#define SDHC_BGCR_STPBGR_STOP SDMMC_BGCR_STPBGR_STOP
#define SDHC_BGCR_CONTR_Pos SDMMC_BGCR_CONTR_Pos
#define SDHC_BGCR_CONTR_Msk SDMMC_BGCR_CONTR_Msk
#define SDHC_BGCR_CONTR(value) SDMMC_BGCR_CONTR(value)
#define SDHC_BGCR_CONTR_GO_ON_Val SDMMC_BGCR_CONTR_GO_ON_Val
#define SDHC_BGCR_CONTR_RESTART_Val SDMMC_BGCR_CONTR_RESTART_Val
#define SDHC_BGCR_CONTR_GO_ON SDMMC_BGCR_CONTR_GO_ON
#define SDHC_BGCR_CONTR_RESTART SDMMC_BGCR_CONTR_RESTART
#define SDHC_BGCR_RWCTRL_Pos SDMMC_BGCR_RWCTRL_Pos
#define SDHC_BGCR_RWCTRL_Msk SDMMC_BGCR_RWCTRL_Msk
#define SDHC_BGCR_RWCTRL(value) SDMMC_BGCR_RWCTRL(value)
#define SDHC_BGCR_RWCTRL_DISABLE_Val SDMMC_BGCR_RWCTRL_DISABLE_Val
#define SDHC_BGCR_RWCTRL_ENABLE_Val SDMMC_BGCR_RWCTRL_ENABLE_Val
#define SDHC_BGCR_RWCTRL_DISABLE SDMMC_BGCR_RWCTRL_DISABLE
#define SDHC_BGCR_RWCTRL_ENABLE SDMMC_BGCR_RWCTRL_ENABLE
#define SDHC_BGCR_INTBG_Pos SDMMC_BGCR_INTBG_Pos
#define SDHC_BGCR_INTBG_Msk SDMMC_BGCR_INTBG_Msk
#define SDHC_BGCR_INTBG(value) SDMMC_BGCR_INTBG(value)
#define SDHC_BGCR_INTBG_DISABLED_Val SDMMC_BGCR_INTBG_DISABLED_Val
#define SDHC_BGCR_INTBG_ENABLED_Val SDMMC_BGCR_INTBG_ENABLED_Val
#define SDHC_BGCR_INTBG_DISABLED SDMMC_BGCR_INTBG_DISABLED
#define SDHC_BGCR_INTBG_ENABLED SDMMC_BGCR_INTBG_ENABLED
#define SDHC_BGCR_Msk SDMMC_BGCR_Msk

/* EMMC mode */
#define SDHC_BGCR_EMMC_Msk SDMMC_BGCR_EMMC_Msk

/* SDHC_WCR : (SDMMC Offset: 0x2B) (R/W 8) Wakeup Control */
#define SDHC_WCR_RESETVALUE SDMMC_WCR_RESETVALUE

#define SDHC_WCR_WKENCINT_Pos SDMMC_WCR_WKENCINT_Pos
#define SDHC_WCR_WKENCINT_Msk SDMMC_WCR_WKENCINT_Msk
#define SDHC_WCR_WKENCINT(value) SDMMC_WCR_WKENCINT(value)
#define SDHC_WCR_WKENCINT_DISABLE_Val SDMMC_WCR_WKENCINT_DISABLE_Val
#define SDHC_WCR_WKENCINT_ENABLE_Val SDMMC_WCR_WKENCINT_ENABLE_Val
#define SDHC_WCR_WKENCINT_DISABLE SDMMC_WCR_WKENCINT_DISABLE
#define SDHC_WCR_WKENCINT_ENABLE SDMMC_WCR_WKENCINT_ENABLE
#define SDHC_WCR_WKENCINS_Pos SDMMC_WCR_WKENCINS_Pos
#define SDHC_WCR_WKENCINS_Msk SDMMC_WCR_WKENCINS_Msk
#define SDHC_WCR_WKENCINS(value) SDMMC_WCR_WKENCINS(value)
#define SDHC_WCR_WKENCINS_DISABLE_Val SDMMC_WCR_WKENCINS_DISABLE_Val
#define SDHC_WCR_WKENCINS_ENABLE_Val SDMMC_WCR_WKENCINS_ENABLE_Val
#define SDHC_WCR_WKENCINS_DISABLE SDMMC_WCR_WKENCINS_DISABLE
#define SDHC_WCR_WKENCINS_ENABLE SDMMC_WCR_WKENCINS_ENABLE
#define SDHC_WCR_WKENCREM_Pos SDMMC_WCR_WKENCREM_Pos
#define SDHC_WCR_WKENCREM_Msk SDMMC_WCR_WKENCREM_Msk
#define SDHC_WCR_WKENCREM(value) SDMMC_WCR_WKENCREM(value)
#define SDHC_WCR_WKENCREM_DISABLE_Val SDMMC_WCR_WKENCREM_DISABLE_Val
#define SDHC_WCR_WKENCREM_ENABLE_Val SDMMC_WCR_WKENCREM_ENABLE_Val
#define SDHC_WCR_WKENCREM_DISABLE SDMMC_WCR_WKENCREM_DISABLE
#define SDHC_WCR_WKENCREM_ENABLE SDMMC_WCR_WKENCREM_ENABLE
#define SDHC_WCR_Msk SDMMC_WCR_Msk

/* SDHC_CCR : (SDMMC Offset: 0x2C) (R/W 16) Clock Control */
#define SDHC_CCR_RESETVALUE SDMMC_CCR_RESETVALUE

#define SDHC_CCR_INTCLKEN_Pos SDMMC_CCR_INTCLKEN_Pos
#define SDHC_CCR_INTCLKEN_Msk SDMMC_CCR_INTCLKEN_Msk
#define SDHC_CCR_INTCLKEN(value) SDMMC_CCR_INTCLKEN(value)
#define SDHC_CCR_INTCLKEN_OFF_Val SDMMC_CCR_INTCLKEN_OFF_Val
#define SDHC_CCR_INTCLKEN_ON_Val SDMMC_CCR_INTCLKEN_ON_Val
#define SDHC_CCR_INTCLKEN_OFF SDMMC_CCR_INTCLKEN_OFF
#define SDHC_CCR_INTCLKEN_ON SDMMC_CCR_INTCLKEN_ON
#define SDHC_CCR_INTCLKS_Pos SDMMC_CCR_INTCLKS_Pos
#define SDHC_CCR_INTCLKS_Msk SDMMC_CCR_INTCLKS_Msk
#define SDHC_CCR_INTCLKS(value) SDMMC_CCR_INTCLKS(value)
#define SDHC_CCR_INTCLKS_NOT_READY_Val SDMMC_CCR_INTCLKS_NOT_READY_Val
#define SDHC_CCR_INTCLKS_READY_Val SDMMC_CCR_INTCLKS_READY_Val
#define SDHC_CCR_INTCLKS_NOT_READY SDMMC_CCR_INTCLKS_NOT_READY
#define SDHC_CCR_INTCLKS_READY SDMMC_CCR_INTCLKS_READY
#define SDHC_CCR_SDCLKEN_Pos SDMMC_CCR_SDCLKEN_Pos
#define SDHC_CCR_SDCLKEN_Msk SDMMC_CCR_SDCLKEN_Msk
#define SDHC_CCR_SDCLKEN(value) SDMMC_CCR_SDCLKEN(value)
#define SDHC_CCR_SDCLKEN_DISABLE_Val SDMMC_CCR_SDCLKEN_DISABLE_Val
#define SDHC_CCR_SDCLKEN_ENABLE_Val SDMMC_CCR_SDCLKEN_ENABLE_Val
#define SDHC_CCR_SDCLKEN_DISABLE SDMMC_CCR_SDCLKEN_DISABLE
#define SDHC_CCR_SDCLKEN_ENABLE SDMMC_CCR_SDCLKEN_ENABLE
#define SDHC_CCR_CLKGSEL_Pos SDMMC_CCR_CLKGSEL_Pos
#define SDHC_CCR_CLKGSEL_Msk SDMMC_CCR_CLKGSEL_Msk
#define SDHC_CCR_CLKGSEL(value) SDMMC_CCR_CLKGSEL(value)
#define SDHC_CCR_CLKGSEL_DIV_Val SDMMC_CCR_CLKGSEL_DIV_Val
#define SDHC_CCR_CLKGSEL_PROG_Val SDMMC_CCR_CLKGSEL_PROG_Val
#define SDHC_CCR_CLKGSEL_DIV SDMMC_CCR_CLKGSEL_DIV
#define SDHC_CCR_CLKGSEL_PROG SDMMC_CCR_CLKGSEL_PROG
#define SDHC_CCR_USDCLKFSEL_Pos SDMMC_CCR_USDCLKFSEL_Pos
#define SDHC_CCR_USDCLKFSEL_Msk SDMMC_CCR_USDCLKFSEL_Msk
#define SDHC_CCR_USDCLKFSEL(value) SDMMC_CCR_USDCLKFSEL(value)
#define SDHC_CCR_SDCLKFSEL_Pos SDMMC_CCR_SDCLKFSEL_Pos
#define SDHC_CCR_SDCLKFSEL_Msk SDMMC_CCR_SDCLKFSEL_Msk
#define SDHC_CCR_SDCLKFSEL(value) SDMMC_CCR_SDCLKFSEL(value)
#define SDHC_CCR_Msk SDMMC_CCR_Msk

/* SDHC_TCR : (SDMMC Offset: 0x2E) (R/W 8) Timeout Control */
#define SDHC_TCR_RESETVALUE SDMMC_TCR_RESETVALUE

#define SDHC_TCR_DTCVAL_Pos SDMMC_TCR_DTCVAL_Pos
#define SDHC_TCR_DTCVAL_Msk SDMMC_TCR_DTCVAL_Msk
#define SDHC_TCR_DTCVAL(value) SDMMC_TCR_DTCVAL(value)
#define SDHC_TCR_Msk SDMMC_TCR_Msk

/* SDHC_SRR : (SDMMC Offset: 0x2F) (R/W 8) Software Reset */
#define SDHC_SRR_RESETVALUE SDMMC_SRR_RESETVALUE

#define SDHC_SRR_SWRSTALL_Pos SDMMC_SRR_SWRSTALL_Pos
#define SDHC_SRR_SWRSTALL_Msk SDMMC_SRR_SWRSTALL_Msk
#define SDHC_SRR_SWRSTALL(value) SDMMC_SRR_SWRSTALL(value)
#define SDHC_SRR_SWRSTALL_WORK_Val SDMMC_SRR_SWRSTALL_WORK_Val
#define SDHC_SRR_SWRSTALL_RESET_Val SDMMC_SRR_SWRSTALL_RESET_Val
#define SDHC_SRR_SWRSTALL_WORK SDMMC_SRR_SWRSTALL_WORK
#define SDHC_SRR_SWRSTALL_RESET SDMMC_SRR_SWRSTALL_RESET
#define SDHC_SRR_SWRSTCMD_Pos SDMMC_SRR_SWRSTCMD_Pos
#define SDHC_SRR_SWRSTCMD_Msk SDMMC_SRR_SWRSTCMD_Msk
#define SDHC_SRR_SWRSTCMD(value) SDMMC_SRR_SWRSTCMD(value)
#define SDHC_SRR_SWRSTCMD_WORK_Val SDMMC_SRR_SWRSTCMD_WORK_Val
#define SDHC_SRR_SWRSTCMD_RESET_Val SDMMC_SRR_SWRSTCMD_RESET_Val
#define SDHC_SRR_SWRSTCMD_WORK SDMMC_SRR_SWRSTCMD_WORK
#define SDHC_SRR_SWRSTCMD_RESET SDMMC_SRR_SWRSTCMD_RESET
#define SDHC_SRR_SWRSTDAT_Pos SDMMC_SRR_SWRSTDAT_Pos
#define SDHC_SRR_SWRSTDAT_Msk SDMMC_SRR_SWRSTDAT_Msk
#define SDHC_SRR_SWRSTDAT(value) SDMMC_SRR_SWRSTDAT(value)
#define SDHC_SRR_SWRSTDAT_WORK_Val SDMMC_SRR_SWRSTDAT_WORK_Val
#define SDHC_SRR_SWRSTDAT_RESET_Val SDMMC_SRR_SWRSTDAT_RESET_Val
#define SDHC_SRR_SWRSTDAT_WORK SDMMC_SRR_SWRSTDAT_WORK
#define SDHC_SRR_SWRSTDAT_RESET SDMMC_SRR_SWRSTDAT_RESET
#define SDHC_SRR_Msk SDMMC_SRR_Msk

/* SDHC_NISTR : (SDMMC Offset: 0x30) (R/W 16) Normal Interrupt Status */
#define SDHC_NISTR_RESETVALUE SDMMC_NISTR_RESETVALUE

