Zephyr4Microchip/microchip-hal/packs/pic32c/pic32ck_sg_gc/common/sdhc_pic32ck_sg_gc.h
#define SDHC_NISTR_CMDC_Pos SDMMC_NISTR_CMDC_Pos
#define SDHC_NISTR_CMDC_Msk SDMMC_NISTR_CMDC_Msk
#define SDHC_NISTR_CMDC(value) SDMMC_NISTR_CMDC(value)
#define SDHC_NISTR_CMDC_NO_Val SDMMC_NISTR_CMDC_NO_Val
#define SDHC_NISTR_CMDC_YES_Val SDMMC_NISTR_CMDC_YES_Val
#define SDHC_NISTR_CMDC_NO SDMMC_NISTR_CMDC_NO
#define SDHC_NISTR_CMDC_YES SDMMC_NISTR_CMDC_YES
#define SDHC_NISTR_TRFC_Pos SDMMC_NISTR_TRFC_Pos
#define SDHC_NISTR_TRFC_Msk SDMMC_NISTR_TRFC_Msk
#define SDHC_NISTR_TRFC(value) SDMMC_NISTR_TRFC(value)
#define SDHC_NISTR_TRFC_NO_Val SDMMC_NISTR_TRFC_NO_Val
#define SDHC_NISTR_TRFC_YES_Val SDMMC_NISTR_TRFC_YES_Val
#define SDHC_NISTR_TRFC_NO SDMMC_NISTR_TRFC_NO
#define SDHC_NISTR_TRFC_YES SDMMC_NISTR_TRFC_YES
#define SDHC_NISTR_BLKGE_Pos SDMMC_NISTR_BLKGE_Pos
#define SDHC_NISTR_BLKGE_Msk SDMMC_NISTR_BLKGE_Msk
#define SDHC_NISTR_BLKGE(value) SDMMC_NISTR_BLKGE(value)
#define SDHC_NISTR_BLKGE_NO_Val SDMMC_NISTR_BLKGE_NO_Val
#define SDHC_NISTR_BLKGE_STOP_Val SDMMC_NISTR_BLKGE_STOP_Val
#define SDHC_NISTR_BLKGE_NO SDMMC_NISTR_BLKGE_NO
#define SDHC_NISTR_BLKGE_STOP SDMMC_NISTR_BLKGE_STOP
#define SDHC_NISTR_DMAINT_Pos SDMMC_NISTR_DMAINT_Pos
#define SDHC_NISTR_DMAINT_Msk SDMMC_NISTR_DMAINT_Msk
#define SDHC_NISTR_DMAINT(value) SDMMC_NISTR_DMAINT(value)
#define SDHC_NISTR_DMAINT_NO_Val SDMMC_NISTR_DMAINT_NO_Val
#define SDHC_NISTR_DMAINT_YES_Val SDMMC_NISTR_DMAINT_YES_Val
#define SDHC_NISTR_DMAINT_NO SDMMC_NISTR_DMAINT_NO
#define SDHC_NISTR_DMAINT_YES SDMMC_NISTR_DMAINT_YES
#define SDHC_NISTR_BWRRDY_Pos SDMMC_NISTR_BWRRDY_Pos
#define SDHC_NISTR_BWRRDY_Msk SDMMC_NISTR_BWRRDY_Msk
#define SDHC_NISTR_BWRRDY(value) SDMMC_NISTR_BWRRDY(value)
#define SDHC_NISTR_BWRRDY_NO_Val SDMMC_NISTR_BWRRDY_NO_Val
#define SDHC_NISTR_BWRRDY_YES_Val SDMMC_NISTR_BWRRDY_YES_Val
#define SDHC_NISTR_BWRRDY_NO SDMMC_NISTR_BWRRDY_NO
#define SDHC_NISTR_BWRRDY_YES SDMMC_NISTR_BWRRDY_YES
#define SDHC_NISTR_BRDRDY_Pos SDMMC_NISTR_BRDRDY_Pos
#define SDHC_NISTR_BRDRDY_Msk SDMMC_NISTR_BRDRDY_Msk
#define SDHC_NISTR_BRDRDY(value) SDMMC_NISTR_BRDRDY(value)
#define SDHC_NISTR_BRDRDY_NO_Val SDMMC_NISTR_BRDRDY_NO_Val
#define SDHC_NISTR_BRDRDY_YES_Val SDMMC_NISTR_BRDRDY_YES_Val
#define SDHC_NISTR_BRDRDY_NO SDMMC_NISTR_BRDRDY_NO
#define SDHC_NISTR_BRDRDY_YES SDMMC_NISTR_BRDRDY_YES
#define SDHC_NISTR_CINS_Pos SDMMC_NISTR_CINS_Pos
#define SDHC_NISTR_CINS_Msk SDMMC_NISTR_CINS_Msk
#define SDHC_NISTR_CINS(value) SDMMC_NISTR_CINS(value)
#define SDHC_NISTR_CINS_NO_Val SDMMC_NISTR_CINS_NO_Val
#define SDHC_NISTR_CINS_YES_Val SDMMC_NISTR_CINS_YES_Val
#define SDHC_NISTR_CINS_NO SDMMC_NISTR_CINS_NO
#define SDHC_NISTR_CINS_YES SDMMC_NISTR_CINS_YES
#define SDHC_NISTR_CREM_Pos SDMMC_NISTR_CREM_Pos
#define SDHC_NISTR_CREM_Msk SDMMC_NISTR_CREM_Msk
#define SDHC_NISTR_CREM(value) SDMMC_NISTR_CREM(value)
#define SDHC_NISTR_CREM_NO_Val SDMMC_NISTR_CREM_NO_Val
#define SDHC_NISTR_CREM_YES_Val SDMMC_NISTR_CREM_YES_Val
#define SDHC_NISTR_CREM_NO SDMMC_NISTR_CREM_NO
#define SDHC_NISTR_CREM_YES SDMMC_NISTR_CREM_YES
#define SDHC_NISTR_CINT_Pos SDMMC_NISTR_CINT_Pos
#define SDHC_NISTR_CINT_Msk SDMMC_NISTR_CINT_Msk
#define SDHC_NISTR_CINT(value) SDMMC_NISTR_CINT(value)
#define SDHC_NISTR_CINT_NO_Val SDMMC_NISTR_CINT_NO_Val
#define SDHC_NISTR_CINT_YES_Val SDMMC_NISTR_CINT_YES_Val
#define SDHC_NISTR_CINT_NO SDMMC_NISTR_CINT_NO
#define SDHC_NISTR_CINT_YES SDMMC_NISTR_CINT_YES
#define SDHC_NISTR_ERRINT_Pos SDMMC_NISTR_ERRINT_Pos
#define SDHC_NISTR_ERRINT_Msk SDMMC_NISTR_ERRINT_Msk
#define SDHC_NISTR_ERRINT(value) SDMMC_NISTR_ERRINT(value)
#define SDHC_NISTR_ERRINT_NO_Val SDMMC_NISTR_ERRINT_NO_Val
#define SDHC_NISTR_ERRINT_YES_Val SDMMC_NISTR_ERRINT_YES_Val
#define SDHC_NISTR_ERRINT_NO SDMMC_NISTR_ERRINT_NO
#define SDHC_NISTR_ERRINT_YES SDMMC_NISTR_ERRINT_YES
#define SDHC_NISTR_Msk SDMMC_NISTR_Msk

/* EMMC mode */
#define SDHC_NISTR_EMMC_BOOTAR_Pos SDMMC_NISTR_EMMC_BOOTAR_Pos
#define SDHC_NISTR_EMMC_BOOTAR_Msk SDMMC_NISTR_EMMC_BOOTAR_Msk
#define SDHC_NISTR_EMMC_BOOTAR(value) SDMMC_NISTR_EMMC_BOOTAR(value)
#define SDHC_NISTR_EMMC_Msk SDMMC_NISTR_EMMC_Msk

/* SDHC_EISTR : (SDMMC Offset: 0x32) (R/W 16) Error Interrupt Status */
#define SDHC_EISTR_RESETVALUE SDMMC_EISTR_RESETVALUE

#define SDHC_EISTR_CMDTEO_Pos SDMMC_EISTR_CMDTEO_Pos
#define SDHC_EISTR_CMDTEO_Msk SDMMC_EISTR_CMDTEO_Msk
#define SDHC_EISTR_CMDTEO(value) SDMMC_EISTR_CMDTEO(value)
#define SDHC_EISTR_CMDTEO_NO_Val SDMMC_EISTR_CMDTEO_NO_Val
#define SDHC_EISTR_CMDTEO_YES_Val SDMMC_EISTR_CMDTEO_YES_Val
#define SDHC_EISTR_CMDTEO_NO SDMMC_EISTR_CMDTEO_NO
#define SDHC_EISTR_CMDTEO_YES SDMMC_EISTR_CMDTEO_YES
#define SDHC_EISTR_CMDCRC_Pos SDMMC_EISTR_CMDCRC_Pos
#define SDHC_EISTR_CMDCRC_Msk SDMMC_EISTR_CMDCRC_Msk
#define SDHC_EISTR_CMDCRC(value) SDMMC_EISTR_CMDCRC(value)
#define SDHC_EISTR_CMDCRC_NO_Val SDMMC_EISTR_CMDCRC_NO_Val
#define SDHC_EISTR_CMDCRC_YES_Val SDMMC_EISTR_CMDCRC_YES_Val
#define SDHC_EISTR_CMDCRC_NO SDMMC_EISTR_CMDCRC_NO
#define SDHC_EISTR_CMDCRC_YES SDMMC_EISTR_CMDCRC_YES
#define SDHC_EISTR_CMDEND_Pos SDMMC_EISTR_CMDEND_Pos
#define SDHC_EISTR_CMDEND_Msk SDMMC_EISTR_CMDEND_Msk
#define SDHC_EISTR_CMDEND(value) SDMMC_EISTR_CMDEND(value)
#define SDHC_EISTR_CMDEND_NO_Val SDMMC_EISTR_CMDEND_NO_Val
#define SDHC_EISTR_CMDEND_YES_Val SDMMC_EISTR_CMDEND_YES_Val
#define SDHC_EISTR_CMDEND_NO SDMMC_EISTR_CMDEND_NO
#define SDHC_EISTR_CMDEND_YES SDMMC_EISTR_CMDEND_YES
#define SDHC_EISTR_CMDIDX_Pos SDMMC_EISTR_CMDIDX_Pos
#define SDHC_EISTR_CMDIDX_Msk SDMMC_EISTR_CMDIDX_Msk
#define SDHC_EISTR_CMDIDX(value) SDMMC_EISTR_CMDIDX(value)
#define SDHC_EISTR_CMDIDX_NO_Val SDMMC_EISTR_CMDIDX_NO_Val
#define SDHC_EISTR_CMDIDX_YES_Val SDMMC_EISTR_CMDIDX_YES_Val
#define SDHC_EISTR_CMDIDX_NO SDMMC_EISTR_CMDIDX_NO
#define SDHC_EISTR_CMDIDX_YES SDMMC_EISTR_CMDIDX_YES
#define SDHC_EISTR_DATTEO_Pos SDMMC_EISTR_DATTEO_Pos
#define SDHC_EISTR_DATTEO_Msk SDMMC_EISTR_DATTEO_Msk
#define SDHC_EISTR_DATTEO(value) SDMMC_EISTR_DATTEO(value)
#define SDHC_EISTR_DATTEO_NO_Val SDMMC_EISTR_DATTEO_NO_Val
#define SDHC_EISTR_DATTEO_YES_Val SDMMC_EISTR_DATTEO_YES_Val
#define SDHC_EISTR_DATTEO_NO SDMMC_EISTR_DATTEO_NO
#define SDHC_EISTR_DATTEO_YES SDMMC_EISTR_DATTEO_YES
#define SDHC_EISTR_DATCRC_Pos SDMMC_EISTR_DATCRC_Pos
#define SDHC_EISTR_DATCRC_Msk SDMMC_EISTR_DATCRC_Msk
#define SDHC_EISTR_DATCRC(value) SDMMC_EISTR_DATCRC(value)
#define SDHC_EISTR_DATCRC_NO_Val SDMMC_EISTR_DATCRC_NO_Val
#define SDHC_EISTR_DATCRC_YES_Val SDMMC_EISTR_DATCRC_YES_Val
#define SDHC_EISTR_DATCRC_NO SDMMC_EISTR_DATCRC_NO
#define SDHC_EISTR_DATCRC_YES SDMMC_EISTR_DATCRC_YES
#define SDHC_EISTR_DATEND_Pos SDMMC_EISTR_DATEND_Pos
#define SDHC_EISTR_DATEND_Msk SDMMC_EISTR_DATEND_Msk
#define SDHC_EISTR_DATEND(value) SDMMC_EISTR_DATEND(value)
#define SDHC_EISTR_DATEND_NO_Val SDMMC_EISTR_DATEND_NO_Val
#define SDHC_EISTR_DATEND_YES_Val SDMMC_EISTR_DATEND_YES_Val
#define SDHC_EISTR_DATEND_NO SDMMC_EISTR_DATEND_NO
#define SDHC_EISTR_DATEND_YES SDMMC_EISTR_DATEND_YES
#define SDHC_EISTR_CURLIM_Pos SDMMC_EISTR_CURLIM_Pos
#define SDHC_EISTR_CURLIM_Msk SDMMC_EISTR_CURLIM_Msk
#define SDHC_EISTR_CURLIM(value) SDMMC_EISTR_CURLIM(value)
#define SDHC_EISTR_CURLIM_NO_Val SDMMC_EISTR_CURLIM_NO_Val
#define SDHC_EISTR_CURLIM_YES_Val SDMMC_EISTR_CURLIM_YES_Val
#define SDHC_EISTR_CURLIM_NO SDMMC_EISTR_CURLIM_NO
#define SDHC_EISTR_CURLIM_YES SDMMC_EISTR_CURLIM_YES
#define SDHC_EISTR_ACMD_Pos SDMMC_EISTR_ACMD_Pos
#define SDHC_EISTR_ACMD_Msk SDMMC_EISTR_ACMD_Msk
#define SDHC_EISTR_ACMD(value) SDMMC_EISTR_ACMD(value)
#define SDHC_EISTR_ACMD_NO_Val SDMMC_EISTR_ACMD_NO_Val
#define SDHC_EISTR_ACMD_YES_Val SDMMC_EISTR_ACMD_YES_Val
#define SDHC_EISTR_ACMD_NO SDMMC_EISTR_ACMD_NO
#define SDHC_EISTR_ACMD_YES SDMMC_EISTR_ACMD_YES
#define SDHC_EISTR_ADMA_Pos SDMMC_EISTR_ADMA_Pos
#define SDHC_EISTR_ADMA_Msk SDMMC_EISTR_ADMA_Msk
#define SDHC_EISTR_ADMA(value) SDMMC_EISTR_ADMA(value)
#define SDHC_EISTR_ADMA_NO_Val SDMMC_EISTR_ADMA_NO_Val
#define SDHC_EISTR_ADMA_YES_Val SDMMC_EISTR_ADMA_YES_Val
#define SDHC_EISTR_ADMA_NO SDMMC_EISTR_ADMA_NO
#define SDHC_EISTR_ADMA_YES SDMMC_EISTR_ADMA_YES
#define SDHC_EISTR_Msk SDMMC_EISTR_Msk

/* EMMC mode */
#define SDHC_EISTR_EMMC_BOOTAE_Pos SDMMC_EISTR_EMMC_BOOTAE_Pos
#define SDHC_EISTR_EMMC_BOOTAE_Msk SDMMC_EISTR_EMMC_BOOTAE_Msk
#define SDHC_EISTR_EMMC_BOOTAE(value) SDMMC_EISTR_EMMC_BOOTAE(value)
#define SDHC_EISTR_EMMC_BOOTAE_0_Val SDMMC_EISTR_EMMC_BOOTAE_0_Val
#define SDHC_EISTR_EMMC_BOOTAE_1_Val SDMMC_EISTR_EMMC_BOOTAE_1_Val
#define SDHC_EISTR_EMMC_BOOTAE_0 SDMMC_EISTR_EMMC_BOOTAE_0
#define SDHC_EISTR_EMMC_BOOTAE_1 SDMMC_EISTR_EMMC_BOOTAE_1
#define SDHC_EISTR_EMMC_Msk SDMMC_EISTR_EMMC_Msk

/* SDHC_NISTER : (SDMMC Offset: 0x34) (R/W 16) Normal Interrupt Status Enable */
#define SDHC_NISTER_RESETVALUE SDMMC_NISTER_RESETVALUE

#define SDHC_NISTER_CMDC_Pos SDMMC_NISTER_CMDC_Pos
#define SDHC_NISTER_CMDC_Msk SDMMC_NISTER_CMDC_Msk
#define SDHC_NISTER_CMDC(value) SDMMC_NISTER_CMDC(value)
#define SDHC_NISTER_CMDC_MASKED_Val SDMMC_NISTER_CMDC_MASKED_Val
#define SDHC_NISTER_CMDC_ENABLED_Val SDMMC_NISTER_CMDC_ENABLED_Val
#define SDHC_NISTER_CMDC_MASKED SDMMC_NISTER_CMDC_MASKED
#define SDHC_NISTER_CMDC_ENABLED SDMMC_NISTER_CMDC_ENABLED
#define SDHC_NISTER_TRFC_Pos SDMMC_NISTER_TRFC_Pos
#define SDHC_NISTER_TRFC_Msk SDMMC_NISTER_TRFC_Msk
#define SDHC_NISTER_TRFC(value) SDMMC_NISTER_TRFC(value)
#define SDHC_NISTER_TRFC_MASKED_Val SDMMC_NISTER_TRFC_MASKED_Val
#define SDHC_NISTER_TRFC_ENABLED_Val SDMMC_NISTER_TRFC_ENABLED_Val
#define SDHC_NISTER_TRFC_MASKED SDMMC_NISTER_TRFC_MASKED
#define SDHC_NISTER_TRFC_ENABLED SDMMC_NISTER_TRFC_ENABLED
#define SDHC_NISTER_BLKGE_Pos SDMMC_NISTER_BLKGE_Pos
#define SDHC_NISTER_BLKGE_Msk SDMMC_NISTER_BLKGE_Msk
#define SDHC_NISTER_BLKGE(value) SDMMC_NISTER_BLKGE(value)
#define SDHC_NISTER_BLKGE_MASKED_Val SDMMC_NISTER_BLKGE_MASKED_Val
#define SDHC_NISTER_BLKGE_ENABLED_Val SDMMC_NISTER_BLKGE_ENABLED_Val
#define SDHC_NISTER_BLKGE_MASKED SDMMC_NISTER_BLKGE_MASKED
#define SDHC_NISTER_BLKGE_ENABLED SDMMC_NISTER_BLKGE_ENABLED
#define SDHC_NISTER_DMAINT_Pos SDMMC_NISTER_DMAINT_Pos
#define SDHC_NISTER_DMAINT_Msk SDMMC_NISTER_DMAINT_Msk
#define SDHC_NISTER_DMAINT(value) SDMMC_NISTER_DMAINT(value)
#define SDHC_NISTER_DMAINT_MASKED_Val SDMMC_NISTER_DMAINT_MASKED_Val
#define SDHC_NISTER_DMAINT_ENABLED_Val SDMMC_NISTER_DMAINT_ENABLED_Val
#define SDHC_NISTER_DMAINT_MASKED SDMMC_NISTER_DMAINT_MASKED
#define SDHC_NISTER_DMAINT_ENABLED SDMMC_NISTER_DMAINT_ENABLED
#define SDHC_NISTER_BWRRDY_Pos SDMMC_NISTER_BWRRDY_Pos
#define SDHC_NISTER_BWRRDY_Msk SDMMC_NISTER_BWRRDY_Msk
#define SDHC_NISTER_BWRRDY(value) SDMMC_NISTER_BWRRDY(value)
#define SDHC_NISTER_BWRRDY_MASKED_Val SDMMC_NISTER_BWRRDY_MASKED_Val
#define SDHC_NISTER_BWRRDY_ENABLED_Val SDMMC_NISTER_BWRRDY_ENABLED_Val
#define SDHC_NISTER_BWRRDY_MASKED SDMMC_NISTER_BWRRDY_MASKED
#define SDHC_NISTER_BWRRDY_ENABLED SDMMC_NISTER_BWRRDY_ENABLED
#define SDHC_NISTER_BRDRDY_Pos SDMMC_NISTER_BRDRDY_Pos
#define SDHC_NISTER_BRDRDY_Msk SDMMC_NISTER_BRDRDY_Msk
#define SDHC_NISTER_BRDRDY(value) SDMMC_NISTER_BRDRDY(value)
#define SDHC_NISTER_BRDRDY_MASKED_Val SDMMC_NISTER_BRDRDY_MASKED_Val
#define SDHC_NISTER_BRDRDY_ENABLED_Val SDMMC_NISTER_BRDRDY_ENABLED_Val
#define SDHC_NISTER_BRDRDY_MASKED SDMMC_NISTER_BRDRDY_MASKED
#define SDHC_NISTER_BRDRDY_ENABLED SDMMC_NISTER_BRDRDY_ENABLED
#define SDHC_NISTER_CINS_Pos SDMMC_NISTER_CINS_Pos
#define SDHC_NISTER_CINS_Msk SDMMC_NISTER_CINS_Msk
#define SDHC_NISTER_CINS(value) SDMMC_NISTER_CINS(value)
#define SDHC_NISTER_CINS_MASKED_Val SDMMC_NISTER_CINS_MASKED_Val
#define SDHC_NISTER_CINS_ENABLED_Val SDMMC_NISTER_CINS_ENABLED_Val
#define SDHC_NISTER_CINS_MASKED SDMMC_NISTER_CINS_MASKED
#define SDHC_NISTER_CINS_ENABLED SDMMC_NISTER_CINS_ENABLED
#define SDHC_NISTER_CREM_Pos SDMMC_NISTER_CREM_Pos
#define SDHC_NISTER_CREM_Msk SDMMC_NISTER_CREM_Msk
#define SDHC_NISTER_CREM(value) SDMMC_NISTER_CREM(value)
#define SDHC_NISTER_CREM_MASKED_Val SDMMC_NISTER_CREM_MASKED_Val
#define SDHC_NISTER_CREM_ENABLED_Val SDMMC_NISTER_CREM_ENABLED_Val
#define SDHC_NISTER_CREM_MASKED SDMMC_NISTER_CREM_MASKED
#define SDHC_NISTER_CREM_ENABLED SDMMC_NISTER_CREM_ENABLED
#define SDHC_NISTER_CINT_Pos SDMMC_NISTER_CINT_Pos
#define SDHC_NISTER_CINT_Msk SDMMC_NISTER_CINT_Msk
#define SDHC_NISTER_CINT(value) SDMMC_NISTER_CINT(value)
#define SDHC_NISTER_CINT_MASKED_Val SDMMC_NISTER_CINT_MASKED_Val
#define SDHC_NISTER_CINT_ENABLED_Val SDMMC_NISTER_CINT_ENABLED_Val
#define SDHC_NISTER_CINT_MASKED SDMMC_NISTER_CINT_MASKED
#define SDHC_NISTER_CINT_ENABLED SDMMC_NISTER_CINT_ENABLED
#define SDHC_NISTER_Msk SDMMC_NISTER_Msk

/* EMMC mode */
#define SDHC_NISTER_EMMC_BOOTAR_Pos SDMMC_NISTER_EMMC_BOOTAR_Pos
#define SDHC_NISTER_EMMC_BOOTAR_Msk SDMMC_NISTER_EMMC_BOOTAR_Msk
#define SDHC_NISTER_EMMC_BOOTAR(value) SDMMC_NISTER_EMMC_BOOTAR(value)
#define SDHC_NISTER_EMMC_Msk SDMMC_NISTER_EMMC_Msk

/* SDHC_EISTER : (SDMMC Offset: 0x36) (R/W 16) Error Interrupt Status Enable */
#define SDHC_EISTER_RESETVALUE SDMMC_EISTER_RESETVALUE

#define SDHC_EISTER_CMDTEO_Pos SDMMC_EISTER_CMDTEO_Pos
#define SDHC_EISTER_CMDTEO_Msk SDMMC_EISTER_CMDTEO_Msk
#define SDHC_EISTER_CMDTEO(value) SDMMC_EISTER_CMDTEO(value)
#define SDHC_EISTER_CMDTEO_MASKED_Val SDMMC_EISTER_CMDTEO_MASKED_Val
#define SDHC_EISTER_CMDTEO_ENABLED_Val SDMMC_EISTER_CMDTEO_ENABLED_Val
#define SDHC_EISTER_CMDTEO_MASKED SDMMC_EISTER_CMDTEO_MASKED
#define SDHC_EISTER_CMDTEO_ENABLED SDMMC_EISTER_CMDTEO_ENABLED
#define SDHC_EISTER_CMDCRC_Pos SDMMC_EISTER_CMDCRC_Pos
#define SDHC_EISTER_CMDCRC_Msk SDMMC_EISTER_CMDCRC_Msk
#define SDHC_EISTER_CMDCRC(value) SDMMC_EISTER_CMDCRC(value)
#define SDHC_EISTER_CMDCRC_MASKED_Val SDMMC_EISTER_CMDCRC_MASKED_Val
#define SDHC_EISTER_CMDCRC_ENABLED_Val SDMMC_EISTER_CMDCRC_ENABLED_Val
#define SDHC_EISTER_CMDCRC_MASKED SDMMC_EISTER_CMDCRC_MASKED
#define SDHC_EISTER_CMDCRC_ENABLED SDMMC_EISTER_CMDCRC_ENABLED
#define SDHC_EISTER_CMDEND_Pos SDMMC_EISTER_CMDEND_Pos
#define SDHC_EISTER_CMDEND_Msk SDMMC_EISTER_CMDEND_Msk
#define SDHC_EISTER_CMDEND(value) SDMMC_EISTER_CMDEND(value)
#define SDHC_EISTER_CMDEND_MASKED_Val SDMMC_EISTER_CMDEND_MASKED_Val
#define SDHC_EISTER_CMDEND_ENABLED_Val SDMMC_EISTER_CMDEND_ENABLED_Val
#define SDHC_EISTER_CMDEND_MASKED SDMMC_EISTER_CMDEND_MASKED
#define SDHC_EISTER_CMDEND_ENABLED SDMMC_EISTER_CMDEND_ENABLED
#define SDHC_EISTER_CMDIDX_Pos SDMMC_EISTER_CMDIDX_Pos
#define SDHC_EISTER_CMDIDX_Msk SDMMC_EISTER_CMDIDX_Msk
#define SDHC_EISTER_CMDIDX(value) SDMMC_EISTER_CMDIDX(value)
#define SDHC_EISTER_CMDIDX_MASKED_Val SDMMC_EISTER_CMDIDX_MASKED_Val
#define SDHC_EISTER_CMDIDX_ENABLED_Val SDMMC_EISTER_CMDIDX_ENABLED_Val
#define SDHC_EISTER_CMDIDX_MASKED SDMMC_EISTER_CMDIDX_MASKED
#define SDHC_EISTER_CMDIDX_ENABLED SDMMC_EISTER_CMDIDX_ENABLED
#define SDHC_EISTER_DATTEO_Pos SDMMC_EISTER_DATTEO_Pos
#define SDHC_EISTER_DATTEO_Msk SDMMC_EISTER_DATTEO_Msk
#define SDHC_EISTER_DATTEO(value) SDMMC_EISTER_DATTEO(value)
#define SDHC_EISTER_DATTEO_MASKED_Val SDMMC_EISTER_DATTEO_MASKED_Val
#define SDHC_EISTER_DATTEO_ENABLED_Val SDMMC_EISTER_DATTEO_ENABLED_Val
#define SDHC_EISTER_DATTEO_MASKED SDMMC_EISTER_DATTEO_MASKED
#define SDHC_EISTER_DATTEO_ENABLED SDMMC_EISTER_DATTEO_ENABLED
#define SDHC_EISTER_DATCRC_Pos SDMMC_EISTER_DATCRC_Pos
#define SDHC_EISTER_DATCRC_Msk SDMMC_EISTER_DATCRC_Msk
#define SDHC_EISTER_DATCRC(value) SDMMC_EISTER_DATCRC(value)
#define SDHC_EISTER_DATCRC_MASKED_Val SDMMC_EISTER_DATCRC_MASKED_Val
#define SDHC_EISTER_DATCRC_ENABLED_Val SDMMC_EISTER_DATCRC_ENABLED_Val
#define SDHC_EISTER_DATCRC_MASKED SDMMC_EISTER_DATCRC_MASKED
#define SDHC_EISTER_DATCRC_ENABLED SDMMC_EISTER_DATCRC_ENABLED
#define SDHC_EISTER_DATEND_Pos SDMMC_EISTER_DATEND_Pos
#define SDHC_EISTER_DATEND_Msk SDMMC_EISTER_DATEND_Msk
#define SDHC_EISTER_DATEND(value) SDMMC_EISTER_DATEND(value)
#define SDHC_EISTER_DATEND_MASKED_Val SDMMC_EISTER_DATEND_MASKED_Val
#define SDHC_EISTER_DATEND_ENABLED_Val SDMMC_EISTER_DATEND_ENABLED_Val
#define SDHC_EISTER_DATEND_MASKED SDMMC_EISTER_DATEND_MASKED
#define SDHC_EISTER_DATEND_ENABLED SDMMC_EISTER_DATEND_ENABLED
#define SDHC_EISTER_CURLIM_Pos SDMMC_EISTER_CURLIM_Pos
#define SDHC_EISTER_CURLIM_Msk SDMMC_EISTER_CURLIM_Msk
#define SDHC_EISTER_CURLIM(value) SDMMC_EISTER_CURLIM(value)
#define SDHC_EISTER_CURLIM_MASKED_Val SDMMC_EISTER_CURLIM_MASKED_Val
#define SDHC_EISTER_CURLIM_ENABLED_Val SDMMC_EISTER_CURLIM_ENABLED_Val
#define SDHC_EISTER_CURLIM_MASKED SDMMC_EISTER_CURLIM_MASKED
#define SDHC_EISTER_CURLIM_ENABLED SDMMC_EISTER_CURLIM_ENABLED
#define SDHC_EISTER_ACMD_Pos SDMMC_EISTER_ACMD_Pos
#define SDHC_EISTER_ACMD_Msk SDMMC_EISTER_ACMD_Msk
#define SDHC_EISTER_ACMD(value) SDMMC_EISTER_ACMD(value)
#define SDHC_EISTER_ACMD_MASKED_Val SDMMC_EISTER_ACMD_MASKED_Val
#define SDHC_EISTER_ACMD_ENABLED_Val SDMMC_EISTER_ACMD_ENABLED_Val
#define SDHC_EISTER_ACMD_MASKED SDMMC_EISTER_ACMD_MASKED
#define SDHC_EISTER_ACMD_ENABLED SDMMC_EISTER_ACMD_ENABLED
#define SDHC_EISTER_ADMA_Pos SDMMC_EISTER_ADMA_Pos
#define SDHC_EISTER_ADMA_Msk SDMMC_EISTER_ADMA_Msk
#define SDHC_EISTER_ADMA(value) SDMMC_EISTER_ADMA(value)
#define SDHC_EISTER_ADMA_MASKED_Val SDMMC_EISTER_ADMA_MASKED_Val
#define SDHC_EISTER_ADMA_ENABLED_Val SDMMC_EISTER_ADMA_ENABLED_Val
#define SDHC_EISTER_ADMA_MASKED SDMMC_EISTER_ADMA_MASKED
#define SDHC_EISTER_ADMA_ENABLED SDMMC_EISTER_ADMA_ENABLED
#define SDHC_EISTER_Msk SDMMC_EISTER_Msk

/* EMMC mode */
#define SDHC_EISTER_EMMC_BOOTAE_Pos SDMMC_EISTER_EMMC_BOOTAE_Pos
#define SDHC_EISTER_EMMC_BOOTAE_Msk SDMMC_EISTER_EMMC_BOOTAE_Msk
#define SDHC_EISTER_EMMC_BOOTAE(value) SDMMC_EISTER_EMMC_BOOTAE(value)
#define SDHC_EISTER_EMMC_Msk SDMMC_EISTER_EMMC_Msk

/* SDHC_NISIER : (SDMMC Offset: 0x38) (R/W 16) Normal Interrupt Signal Enable */
#define SDHC_NISIER_RESETVALUE SDMMC_NISIER_RESETVALUE

#define SDHC_NISIER_CMDC_Pos SDMMC_NISIER_CMDC_Pos
#define SDHC_NISIER_CMDC_Msk SDMMC_NISIER_CMDC_Msk
#define SDHC_NISIER_CMDC(value) SDMMC_NISIER_CMDC(value)
#define SDHC_NISIER_CMDC_MASKED_Val SDMMC_NISIER_CMDC_MASKED_Val
#define SDHC_NISIER_CMDC_ENABLED_Val SDMMC_NISIER_CMDC_ENABLED_Val
#define SDHC_NISIER_CMDC_MASKED SDMMC_NISIER_CMDC_MASKED
#define SDHC_NISIER_CMDC_ENABLED SDMMC_NISIER_CMDC_ENABLED
#define SDHC_NISIER_TRFC_Pos SDMMC_NISIER_TRFC_Pos
#define SDHC_NISIER_TRFC_Msk SDMMC_NISIER_TRFC_Msk
#define SDHC_NISIER_TRFC(value) SDMMC_NISIER_TRFC(value)
#define SDHC_NISIER_TRFC_MASKED_Val SDMMC_NISIER_TRFC_MASKED_Val
#define SDHC_NISIER_TRFC_ENABLED_Val SDMMC_NISIER_TRFC_ENABLED_Val
#define SDHC_NISIER_TRFC_MASKED SDMMC_NISIER_TRFC_MASKED
#define SDHC_NISIER_TRFC_ENABLED SDMMC_NISIER_TRFC_ENABLED
#define SDHC_NISIER_BLKGE_Pos SDMMC_NISIER_BLKGE_Pos
#define SDHC_NISIER_BLKGE_Msk SDMMC_NISIER_BLKGE_Msk
#define SDHC_NISIER_BLKGE(value) SDMMC_NISIER_BLKGE(value)
#define SDHC_NISIER_BLKGE_MASKED_Val SDMMC_NISIER_BLKGE_MASKED_Val
#define SDHC_NISIER_BLKGE_ENABLED_Val SDMMC_NISIER_BLKGE_ENABLED_Val
#define SDHC_NISIER_BLKGE_MASKED SDMMC_NISIER_BLKGE_MASKED
#define SDHC_NISIER_BLKGE_ENABLED SDMMC_NISIER_BLKGE_ENABLED
#define SDHC_NISIER_DMAINT_Pos SDMMC_NISIER_DMAINT_Pos
#define SDHC_NISIER_DMAINT_Msk SDMMC_NISIER_DMAINT_Msk
#define SDHC_NISIER_DMAINT(value) SDMMC_NISIER_DMAINT(value)
#define SDHC_NISIER_DMAINT_MASKED_Val SDMMC_NISIER_DMAINT_MASKED_Val
#define SDHC_NISIER_DMAINT_ENABLED_Val SDMMC_NISIER_DMAINT_ENABLED_Val
#define SDHC_NISIER_DMAINT_MASKED SDMMC_NISIER_DMAINT_MASKED
#define SDHC_NISIER_DMAINT_ENABLED SDMMC_NISIER_DMAINT_ENABLED
#define SDHC_NISIER_BWRRDY_Pos SDMMC_NISIER_BWRRDY_Pos
#define SDHC_NISIER_BWRRDY_Msk SDMMC_NISIER_BWRRDY_Msk
#define SDHC_NISIER_BWRRDY(value) SDMMC_NISIER_BWRRDY(value)
#define SDHC_NISIER_BWRRDY_MASKED_Val SDMMC_NISIER_BWRRDY_MASKED_Val
#define SDHC_NISIER_BWRRDY_ENABLED_Val SDMMC_NISIER_BWRRDY_ENABLED_Val
#define SDHC_NISIER_BWRRDY_MASKED SDMMC_NISIER_BWRRDY_MASKED
#define SDHC_NISIER_BWRRDY_ENABLED SDMMC_NISIER_BWRRDY_ENABLED
#define SDHC_NISIER_BRDRDY_Pos SDMMC_NISIER_BRDRDY_Pos
#define SDHC_NISIER_BRDRDY_Msk SDMMC_NISIER_BRDRDY_Msk
#define SDHC_NISIER_BRDRDY(value) SDMMC_NISIER_BRDRDY(value)
#define SDHC_NISIER_BRDRDY_MASKED_Val SDMMC_NISIER_BRDRDY_MASKED_Val
#define SDHC_NISIER_BRDRDY_ENABLED_Val SDMMC_NISIER_BRDRDY_ENABLED_Val
#define SDHC_NISIER_BRDRDY_MASKED SDMMC_NISIER_BRDRDY_MASKED
#define SDHC_NISIER_BRDRDY_ENABLED SDMMC_NISIER_BRDRDY_ENABLED
#define SDHC_NISIER_CINS_Pos SDMMC_NISIER_CINS_Pos
#define SDHC_NISIER_CINS_Msk SDMMC_NISIER_CINS_Msk
#define SDHC_NISIER_CINS(value) SDMMC_NISIER_CINS(value)
#define SDHC_NISIER_CINS_MASKED_Val SDMMC_NISIER_CINS_MASKED_Val
#define SDHC_NISIER_CINS_ENABLED_Val SDMMC_NISIER_CINS_ENABLED_Val
#define SDHC_NISIER_CINS_MASKED SDMMC_NISIER_CINS_MASKED
#define SDHC_NISIER_CINS_ENABLED SDMMC_NISIER_CINS_ENABLED
#define SDHC_NISIER_CREM_Pos SDMMC_NISIER_CREM_Pos
#define SDHC_NISIER_CREM_Msk SDMMC_NISIER_CREM_Msk
#define SDHC_NISIER_CREM(value) SDMMC_NISIER_CREM(value)
#define SDHC_NISIER_CREM_MASKED_Val SDMMC_NISIER_CREM_MASKED_Val
#define SDHC_NISIER_CREM_ENABLED_Val SDMMC_NISIER_CREM_ENABLED_Val
#define SDHC_NISIER_CREM_MASKED SDMMC_NISIER_CREM_MASKED
#define SDHC_NISIER_CREM_ENABLED SDMMC_NISIER_CREM_ENABLED
#define SDHC_NISIER_CINT_Pos SDMMC_NISIER_CINT_Pos
#define SDHC_NISIER_CINT_Msk SDMMC_NISIER_CINT_Msk
#define SDHC_NISIER_CINT(value) SDMMC_NISIER_CINT(value)
#define SDHC_NISIER_CINT_MASKED_Val SDMMC_NISIER_CINT_MASKED_Val
#define SDHC_NISIER_CINT_ENABLED_Val SDMMC_NISIER_CINT_ENABLED_Val
#define SDHC_NISIER_CINT_MASKED SDMMC_NISIER_CINT_MASKED
#define SDHC_NISIER_CINT_ENABLED SDMMC_NISIER_CINT_ENABLED
#define SDHC_NISIER_Msk SDMMC_NISIER_Msk

/* EMMC mode */
#define SDHC_NISIER_EMMC_BOOTAR_Pos SDMMC_NISIER_EMMC_BOOTAR_Pos
#define SDHC_NISIER_EMMC_BOOTAR_Msk SDMMC_NISIER_EMMC_BOOTAR_Msk
#define SDHC_NISIER_EMMC_BOOTAR(value) SDMMC_NISIER_EMMC_BOOTAR(value)
#define SDHC_NISIER_EMMC_Msk SDMMC_NISIER_EMMC_Msk

/* SDHC_EISIER : (SDMMC Offset: 0x3A) (R/W 16) Error Interrupt Signal Enable */
#define SDHC_EISIER_RESETVALUE SDMMC_EISIER_RESETVALUE

