Zephyr4Microchip/microchip-hal/packs/pic32c/pic32ck_sg_gc/common/sdhc_pic32ck_sg_gc.h
#define SDHC_EISIER_CMDTEO_Pos SDMMC_EISIER_CMDTEO_Pos
#define SDHC_EISIER_CMDTEO_Msk SDMMC_EISIER_CMDTEO_Msk
#define SDHC_EISIER_CMDTEO(value) SDMMC_EISIER_CMDTEO(value)
#define SDHC_EISIER_CMDTEO_MASKED_Val SDMMC_EISIER_CMDTEO_MASKED_Val
#define SDHC_EISIER_CMDTEO_ENABLED_Val SDMMC_EISIER_CMDTEO_ENABLED_Val
#define SDHC_EISIER_CMDTEO_MASKED SDMMC_EISIER_CMDTEO_MASKED
#define SDHC_EISIER_CMDTEO_ENABLED SDMMC_EISIER_CMDTEO_ENABLED
#define SDHC_EISIER_CMDCRC_Pos SDMMC_EISIER_CMDCRC_Pos
#define SDHC_EISIER_CMDCRC_Msk SDMMC_EISIER_CMDCRC_Msk
#define SDHC_EISIER_CMDCRC(value) SDMMC_EISIER_CMDCRC(value)
#define SDHC_EISIER_CMDCRC_MASKED_Val SDMMC_EISIER_CMDCRC_MASKED_Val
#define SDHC_EISIER_CMDCRC_ENABLED_Val SDMMC_EISIER_CMDCRC_ENABLED_Val
#define SDHC_EISIER_CMDCRC_MASKED SDMMC_EISIER_CMDCRC_MASKED
#define SDHC_EISIER_CMDCRC_ENABLED SDMMC_EISIER_CMDCRC_ENABLED
#define SDHC_EISIER_CMDEND_Pos SDMMC_EISIER_CMDEND_Pos
#define SDHC_EISIER_CMDEND_Msk SDMMC_EISIER_CMDEND_Msk
#define SDHC_EISIER_CMDEND(value) SDMMC_EISIER_CMDEND(value)
#define SDHC_EISIER_CMDEND_MASKED_Val SDMMC_EISIER_CMDEND_MASKED_Val
#define SDHC_EISIER_CMDEND_ENABLED_Val SDMMC_EISIER_CMDEND_ENABLED_Val
#define SDHC_EISIER_CMDEND_MASKED SDMMC_EISIER_CMDEND_MASKED
#define SDHC_EISIER_CMDEND_ENABLED SDMMC_EISIER_CMDEND_ENABLED
#define SDHC_EISIER_CMDIDX_Pos SDMMC_EISIER_CMDIDX_Pos
#define SDHC_EISIER_CMDIDX_Msk SDMMC_EISIER_CMDIDX_Msk
#define SDHC_EISIER_CMDIDX(value) SDMMC_EISIER_CMDIDX(value)
#define SDHC_EISIER_CMDIDX_MASKED_Val SDMMC_EISIER_CMDIDX_MASKED_Val
#define SDHC_EISIER_CMDIDX_ENABLED_Val SDMMC_EISIER_CMDIDX_ENABLED_Val
#define SDHC_EISIER_CMDIDX_MASKED SDMMC_EISIER_CMDIDX_MASKED
#define SDHC_EISIER_CMDIDX_ENABLED SDMMC_EISIER_CMDIDX_ENABLED
#define SDHC_EISIER_DATTEO_Pos SDMMC_EISIER_DATTEO_Pos
#define SDHC_EISIER_DATTEO_Msk SDMMC_EISIER_DATTEO_Msk
#define SDHC_EISIER_DATTEO(value) SDMMC_EISIER_DATTEO(value)
#define SDHC_EISIER_DATTEO_MASKED_Val SDMMC_EISIER_DATTEO_MASKED_Val
#define SDHC_EISIER_DATTEO_ENABLED_Val SDMMC_EISIER_DATTEO_ENABLED_Val
#define SDHC_EISIER_DATTEO_MASKED SDMMC_EISIER_DATTEO_MASKED
#define SDHC_EISIER_DATTEO_ENABLED SDMMC_EISIER_DATTEO_ENABLED
#define SDHC_EISIER_DATCRC_Pos SDMMC_EISIER_DATCRC_Pos
#define SDHC_EISIER_DATCRC_Msk SDMMC_EISIER_DATCRC_Msk
#define SDHC_EISIER_DATCRC(value) SDMMC_EISIER_DATCRC(value)
#define SDHC_EISIER_DATCRC_MASKED_Val SDMMC_EISIER_DATCRC_MASKED_Val
#define SDHC_EISIER_DATCRC_ENABLED_Val SDMMC_EISIER_DATCRC_ENABLED_Val
#define SDHC_EISIER_DATCRC_MASKED SDMMC_EISIER_DATCRC_MASKED
#define SDHC_EISIER_DATCRC_ENABLED SDMMC_EISIER_DATCRC_ENABLED
#define SDHC_EISIER_DATEND_Pos SDMMC_EISIER_DATEND_Pos
#define SDHC_EISIER_DATEND_Msk SDMMC_EISIER_DATEND_Msk
#define SDHC_EISIER_DATEND(value) SDMMC_EISIER_DATEND(value)
#define SDHC_EISIER_DATEND_MASKED_Val SDMMC_EISIER_DATEND_MASKED_Val
#define SDHC_EISIER_DATEND_ENABLED_Val SDMMC_EISIER_DATEND_ENABLED_Val
#define SDHC_EISIER_DATEND_MASKED SDMMC_EISIER_DATEND_MASKED
#define SDHC_EISIER_DATEND_ENABLED SDMMC_EISIER_DATEND_ENABLED
#define SDHC_EISIER_CURLIM_Pos SDMMC_EISIER_CURLIM_Pos
#define SDHC_EISIER_CURLIM_Msk SDMMC_EISIER_CURLIM_Msk
#define SDHC_EISIER_CURLIM(value) SDMMC_EISIER_CURLIM(value)
#define SDHC_EISIER_CURLIM_MASKED_Val SDMMC_EISIER_CURLIM_MASKED_Val
#define SDHC_EISIER_CURLIM_ENABLED_Val SDMMC_EISIER_CURLIM_ENABLED_Val
#define SDHC_EISIER_CURLIM_MASKED SDMMC_EISIER_CURLIM_MASKED
#define SDHC_EISIER_CURLIM_ENABLED SDMMC_EISIER_CURLIM_ENABLED
#define SDHC_EISIER_ACMD_Pos SDMMC_EISIER_ACMD_Pos
#define SDHC_EISIER_ACMD_Msk SDMMC_EISIER_ACMD_Msk
#define SDHC_EISIER_ACMD(value) SDMMC_EISIER_ACMD(value)
#define SDHC_EISIER_ACMD_MASKED_Val SDMMC_EISIER_ACMD_MASKED_Val
#define SDHC_EISIER_ACMD_ENABLED_Val SDMMC_EISIER_ACMD_ENABLED_Val
#define SDHC_EISIER_ACMD_MASKED SDMMC_EISIER_ACMD_MASKED
#define SDHC_EISIER_ACMD_ENABLED SDMMC_EISIER_ACMD_ENABLED
#define SDHC_EISIER_ADMA_Pos SDMMC_EISIER_ADMA_Pos
#define SDHC_EISIER_ADMA_Msk SDMMC_EISIER_ADMA_Msk
#define SDHC_EISIER_ADMA(value) SDMMC_EISIER_ADMA(value)
#define SDHC_EISIER_ADMA_MASKED_Val SDMMC_EISIER_ADMA_MASKED_Val
#define SDHC_EISIER_ADMA_ENABLED_Val SDMMC_EISIER_ADMA_ENABLED_Val
#define SDHC_EISIER_ADMA_MASKED SDMMC_EISIER_ADMA_MASKED
#define SDHC_EISIER_ADMA_ENABLED SDMMC_EISIER_ADMA_ENABLED
#define SDHC_EISIER_Msk SDMMC_EISIER_Msk

/* EMMC mode */
#define SDHC_EISIER_EMMC_BOOTAE_Pos SDMMC_EISIER_EMMC_BOOTAE_Pos
#define SDHC_EISIER_EMMC_BOOTAE_Msk SDMMC_EISIER_EMMC_BOOTAE_Msk
#define SDHC_EISIER_EMMC_BOOTAE(value) SDMMC_EISIER_EMMC_BOOTAE(value)
#define SDHC_EISIER_EMMC_Msk SDMMC_EISIER_EMMC_Msk

/* SDHC_ACESR : (SDMMC Offset: 0x3C) ( R/ 16) Auto CMD Error Status */
#define SDHC_ACESR_RESETVALUE SDMMC_ACESR_RESETVALUE

#define SDHC_ACESR_ACMD12NE_Pos SDMMC_ACESR_ACMD12NE_Pos
#define SDHC_ACESR_ACMD12NE_Msk SDMMC_ACESR_ACMD12NE_Msk
#define SDHC_ACESR_ACMD12NE(value) SDMMC_ACESR_ACMD12NE(value)
#define SDHC_ACESR_ACMD12NE_EXEC_Val SDMMC_ACESR_ACMD12NE_EXEC_Val
#define SDHC_ACESR_ACMD12NE_NOT_EXEC_Val SDMMC_ACESR_ACMD12NE_NOT_EXEC_Val
#define SDHC_ACESR_ACMD12NE_EXEC SDMMC_ACESR_ACMD12NE_EXEC
#define SDHC_ACESR_ACMD12NE_NOT_EXEC SDMMC_ACESR_ACMD12NE_NOT_EXEC
#define SDHC_ACESR_ACMDTEO_Pos SDMMC_ACESR_ACMDTEO_Pos
#define SDHC_ACESR_ACMDTEO_Msk SDMMC_ACESR_ACMDTEO_Msk
#define SDHC_ACESR_ACMDTEO(value) SDMMC_ACESR_ACMDTEO(value)
#define SDHC_ACESR_ACMDTEO_NO_Val SDMMC_ACESR_ACMDTEO_NO_Val
#define SDHC_ACESR_ACMDTEO_YES_Val SDMMC_ACESR_ACMDTEO_YES_Val
#define SDHC_ACESR_ACMDTEO_NO SDMMC_ACESR_ACMDTEO_NO
#define SDHC_ACESR_ACMDTEO_YES SDMMC_ACESR_ACMDTEO_YES
#define SDHC_ACESR_ACMDCRC_Pos SDMMC_ACESR_ACMDCRC_Pos
#define SDHC_ACESR_ACMDCRC_Msk SDMMC_ACESR_ACMDCRC_Msk
#define SDHC_ACESR_ACMDCRC(value) SDMMC_ACESR_ACMDCRC(value)
#define SDHC_ACESR_ACMDCRC_NO_Val SDMMC_ACESR_ACMDCRC_NO_Val
#define SDHC_ACESR_ACMDCRC_YES_Val SDMMC_ACESR_ACMDCRC_YES_Val
#define SDHC_ACESR_ACMDCRC_NO SDMMC_ACESR_ACMDCRC_NO
#define SDHC_ACESR_ACMDCRC_YES SDMMC_ACESR_ACMDCRC_YES
#define SDHC_ACESR_ACMDEND_Pos SDMMC_ACESR_ACMDEND_Pos
#define SDHC_ACESR_ACMDEND_Msk SDMMC_ACESR_ACMDEND_Msk
#define SDHC_ACESR_ACMDEND(value) SDMMC_ACESR_ACMDEND(value)
#define SDHC_ACESR_ACMDEND_NO_Val SDMMC_ACESR_ACMDEND_NO_Val
#define SDHC_ACESR_ACMDEND_YES_Val SDMMC_ACESR_ACMDEND_YES_Val
#define SDHC_ACESR_ACMDEND_NO SDMMC_ACESR_ACMDEND_NO
#define SDHC_ACESR_ACMDEND_YES SDMMC_ACESR_ACMDEND_YES
#define SDHC_ACESR_ACMDIDX_Pos SDMMC_ACESR_ACMDIDX_Pos
#define SDHC_ACESR_ACMDIDX_Msk SDMMC_ACESR_ACMDIDX_Msk
#define SDHC_ACESR_ACMDIDX(value) SDMMC_ACESR_ACMDIDX(value)
#define SDHC_ACESR_ACMDIDX_NO_Val SDMMC_ACESR_ACMDIDX_NO_Val
#define SDHC_ACESR_ACMDIDX_YES_Val SDMMC_ACESR_ACMDIDX_YES_Val
#define SDHC_ACESR_ACMDIDX_NO SDMMC_ACESR_ACMDIDX_NO
#define SDHC_ACESR_ACMDIDX_YES SDMMC_ACESR_ACMDIDX_YES
#define SDHC_ACESR_CMDNI_Pos SDMMC_ACESR_CMDNI_Pos
#define SDHC_ACESR_CMDNI_Msk SDMMC_ACESR_CMDNI_Msk
#define SDHC_ACESR_CMDNI(value) SDMMC_ACESR_CMDNI(value)
#define SDHC_ACESR_CMDNI_OK_Val SDMMC_ACESR_CMDNI_OK_Val
#define SDHC_ACESR_CMDNI_NOT_ISSUED_Val SDMMC_ACESR_CMDNI_NOT_ISSUED_Val
#define SDHC_ACESR_CMDNI_OK SDMMC_ACESR_CMDNI_OK
#define SDHC_ACESR_CMDNI_NOT_ISSUED SDMMC_ACESR_CMDNI_NOT_ISSUED
#define SDHC_ACESR_Msk SDMMC_ACESR_Msk

/* SDHC_HC2R : (SDMMC Offset: 0x3E) (R/W 16) Host Control 2 */
#define SDHC_HC2R_RESETVALUE SDMMC_HC2R_RESETVALUE

#define SDHC_HC2R_UHSMS_Pos SDMMC_HC2R_UHSMS_Pos
#define SDHC_HC2R_UHSMS_Msk SDMMC_HC2R_UHSMS_Msk
#define SDHC_HC2R_UHSMS(value) SDMMC_HC2R_UHSMS(value)
#define SDHC_HC2R_UHSMS_SDR12_Val SDMMC_HC2R_UHSMS_SDR12_Val
#define SDHC_HC2R_UHSMS_SDR25_Val SDMMC_HC2R_UHSMS_SDR25_Val
#define SDHC_HC2R_UHSMS_SDR50_Val SDMMC_HC2R_UHSMS_SDR50_Val
#define SDHC_HC2R_UHSMS_SDR104_Val SDMMC_HC2R_UHSMS_SDR104_Val
#define SDHC_HC2R_UHSMS_DDR50_Val SDMMC_HC2R_UHSMS_DDR50_Val
#define SDHC_HC2R_UHSMS_SDR12 SDMMC_HC2R_UHSMS_SDR12
#define SDHC_HC2R_UHSMS_SDR25 SDMMC_HC2R_UHSMS_SDR25
#define SDHC_HC2R_UHSMS_SDR50 SDMMC_HC2R_UHSMS_SDR50
#define SDHC_HC2R_UHSMS_SDR104 SDMMC_HC2R_UHSMS_SDR104
#define SDHC_HC2R_UHSMS_DDR50 SDMMC_HC2R_UHSMS_DDR50
#define SDHC_HC2R_VS18EN_Pos SDMMC_HC2R_VS18EN_Pos
#define SDHC_HC2R_VS18EN_Msk SDMMC_HC2R_VS18EN_Msk
#define SDHC_HC2R_VS18EN(value) SDMMC_HC2R_VS18EN(value)
#define SDHC_HC2R_VS18EN_S33V_Val SDMMC_HC2R_VS18EN_S33V_Val
#define SDHC_HC2R_VS18EN_S18V_Val SDMMC_HC2R_VS18EN_S18V_Val
#define SDHC_HC2R_VS18EN_S33V SDMMC_HC2R_VS18EN_S33V
#define SDHC_HC2R_VS18EN_S18V SDMMC_HC2R_VS18EN_S18V
#define SDHC_HC2R_DRVSEL_Pos SDMMC_HC2R_DRVSEL_Pos
#define SDHC_HC2R_DRVSEL_Msk SDMMC_HC2R_DRVSEL_Msk
#define SDHC_HC2R_DRVSEL(value) SDMMC_HC2R_DRVSEL(value)
#define SDHC_HC2R_DRVSEL_B_Val SDMMC_HC2R_DRVSEL_B_Val
#define SDHC_HC2R_DRVSEL_A_Val SDMMC_HC2R_DRVSEL_A_Val
#define SDHC_HC2R_DRVSEL_C_Val SDMMC_HC2R_DRVSEL_C_Val
#define SDHC_HC2R_DRVSEL_D_Val SDMMC_HC2R_DRVSEL_D_Val
#define SDHC_HC2R_DRVSEL_B SDMMC_HC2R_DRVSEL_B
#define SDHC_HC2R_DRVSEL_A SDMMC_HC2R_DRVSEL_A
#define SDHC_HC2R_DRVSEL_C SDMMC_HC2R_DRVSEL_C
#define SDHC_HC2R_DRVSEL_D SDMMC_HC2R_DRVSEL_D
#define SDHC_HC2R_EXTUN_Pos SDMMC_HC2R_EXTUN_Pos
#define SDHC_HC2R_EXTUN_Msk SDMMC_HC2R_EXTUN_Msk
#define SDHC_HC2R_EXTUN(value) SDMMC_HC2R_EXTUN(value)
#define SDHC_HC2R_EXTUN_NO_Val SDMMC_HC2R_EXTUN_NO_Val
#define SDHC_HC2R_EXTUN_REQUESTED_Val SDMMC_HC2R_EXTUN_REQUESTED_Val
#define SDHC_HC2R_EXTUN_NO SDMMC_HC2R_EXTUN_NO
#define SDHC_HC2R_EXTUN_REQUESTED SDMMC_HC2R_EXTUN_REQUESTED
#define SDHC_HC2R_SLCKSEL_Pos SDMMC_HC2R_SLCKSEL_Pos
#define SDHC_HC2R_SLCKSEL_Msk SDMMC_HC2R_SLCKSEL_Msk
#define SDHC_HC2R_SLCKSEL(value) SDMMC_HC2R_SLCKSEL(value)
#define SDHC_HC2R_SLCKSEL_FIXED_Val SDMMC_HC2R_SLCKSEL_FIXED_Val
#define SDHC_HC2R_SLCKSEL_TUNED_Val SDMMC_HC2R_SLCKSEL_TUNED_Val
#define SDHC_HC2R_SLCKSEL_FIXED SDMMC_HC2R_SLCKSEL_FIXED
#define SDHC_HC2R_SLCKSEL_TUNED SDMMC_HC2R_SLCKSEL_TUNED
#define SDHC_HC2R_ASINTEN_Pos SDMMC_HC2R_ASINTEN_Pos
#define SDHC_HC2R_ASINTEN_Msk SDMMC_HC2R_ASINTEN_Msk
#define SDHC_HC2R_ASINTEN(value) SDMMC_HC2R_ASINTEN(value)
#define SDHC_HC2R_ASINTEN_DISABLED_Val SDMMC_HC2R_ASINTEN_DISABLED_Val
#define SDHC_HC2R_ASINTEN_ENABLED_Val SDMMC_HC2R_ASINTEN_ENABLED_Val
#define SDHC_HC2R_ASINTEN_DISABLED SDMMC_HC2R_ASINTEN_DISABLED
#define SDHC_HC2R_ASINTEN_ENABLED SDMMC_HC2R_ASINTEN_ENABLED
#define SDHC_HC2R_PVALEN_Pos SDMMC_HC2R_PVALEN_Pos
#define SDHC_HC2R_PVALEN_Msk SDMMC_HC2R_PVALEN_Msk
#define SDHC_HC2R_PVALEN(value) SDMMC_HC2R_PVALEN(value)
#define SDHC_HC2R_PVALEN_HOST_Val SDMMC_HC2R_PVALEN_HOST_Val
#define SDHC_HC2R_PVALEN_AUTO_Val SDMMC_HC2R_PVALEN_AUTO_Val
#define SDHC_HC2R_PVALEN_HOST SDMMC_HC2R_PVALEN_HOST
#define SDHC_HC2R_PVALEN_AUTO SDMMC_HC2R_PVALEN_AUTO
#define SDHC_HC2R_Msk SDMMC_HC2R_Msk

/* EMMC mode */
#define SDHC_HC2R_EMMC_HS200EN_Pos SDMMC_HC2R_EMMC_HS200EN_Pos
#define SDHC_HC2R_EMMC_HS200EN_Msk SDMMC_HC2R_EMMC_HS200EN_Msk
#define SDHC_HC2R_EMMC_HS200EN(value) SDMMC_HC2R_EMMC_HS200EN(value)
#define SDHC_HC2R_EMMC_HS200EN_SDR12_Val SDMMC_HC2R_EMMC_HS200EN_SDR12_Val
#define SDHC_HC2R_EMMC_HS200EN_SDR25_Val SDMMC_HC2R_EMMC_HS200EN_SDR25_Val
#define SDHC_HC2R_EMMC_HS200EN_SDR50_Val SDMMC_HC2R_EMMC_HS200EN_SDR50_Val
#define SDHC_HC2R_EMMC_HS200EN_SDR104_Val SDMMC_HC2R_EMMC_HS200EN_SDR104_Val
#define SDHC_HC2R_EMMC_HS200EN_DDR50_Val SDMMC_HC2R_EMMC_HS200EN_DDR50_Val
#define SDHC_HC2R_EMMC_HS200EN_SDR12 SDMMC_HC2R_EMMC_HS200EN_SDR12
#define SDHC_HC2R_EMMC_HS200EN_SDR25 SDMMC_HC2R_EMMC_HS200EN_SDR25
#define SDHC_HC2R_EMMC_HS200EN_SDR50 SDMMC_HC2R_EMMC_HS200EN_SDR50
#define SDHC_HC2R_EMMC_HS200EN_SDR104 SDMMC_HC2R_EMMC_HS200EN_SDR104
#define SDHC_HC2R_EMMC_HS200EN_DDR50 SDMMC_HC2R_EMMC_HS200EN_DDR50
#define SDHC_HC2R_EMMC_Msk SDMMC_HC2R_EMMC_Msk

/* SDHC_CA0R : (SDMMC Offset: 0x40) (R/W 32) Capabilities 0 */
#define SDHC_CA0R_RESETVALUE SDMMC_CA0R_RESETVALUE

#define SDHC_CA0R_TEOCLKF_Pos SDMMC_CA0R_TEOCLKF_Pos
#define SDHC_CA0R_TEOCLKF_Msk SDMMC_CA0R_TEOCLKF_Msk
#define SDHC_CA0R_TEOCLKF(value) SDMMC_CA0R_TEOCLKF(value)
#define SDHC_CA0R_TEOCLKF_OTHER_Val SDMMC_CA0R_TEOCLKF_OTHER_Val
#define SDHC_CA0R_TEOCLKF_OTHER SDMMC_CA0R_TEOCLKF_OTHER
#define SDHC_CA0R_TEOCLKU_Pos SDMMC_CA0R_TEOCLKU_Pos
#define SDHC_CA0R_TEOCLKU_Msk SDMMC_CA0R_TEOCLKU_Msk
#define SDHC_CA0R_TEOCLKU(value) SDMMC_CA0R_TEOCLKU(value)
#define SDHC_CA0R_TEOCLKU_KHZ_Val SDMMC_CA0R_TEOCLKU_KHZ_Val
#define SDHC_CA0R_TEOCLKU_MHZ_Val SDMMC_CA0R_TEOCLKU_MHZ_Val
#define SDHC_CA0R_TEOCLKU_KHZ SDMMC_CA0R_TEOCLKU_KHZ
#define SDHC_CA0R_TEOCLKU_MHZ SDMMC_CA0R_TEOCLKU_MHZ
#define SDHC_CA0R_BASECLKF_Pos SDMMC_CA0R_BASECLKF_Pos
#define SDHC_CA0R_BASECLKF_Msk SDMMC_CA0R_BASECLKF_Msk
#define SDHC_CA0R_BASECLKF(value) SDMMC_CA0R_BASECLKF(value)
#define SDHC_CA0R_BASECLKF_OTHER_Val SDMMC_CA0R_BASECLKF_OTHER_Val
#define SDHC_CA0R_BASECLKF_OTHER SDMMC_CA0R_BASECLKF_OTHER
#define SDHC_CA0R_MAXBLKL_Pos SDMMC_CA0R_MAXBLKL_Pos
#define SDHC_CA0R_MAXBLKL_Msk SDMMC_CA0R_MAXBLKL_Msk
#define SDHC_CA0R_MAXBLKL(value) SDMMC_CA0R_MAXBLKL(value)
#define SDHC_CA0R_MAXBLKL_512_Val SDMMC_CA0R_MAXBLKL_512_Val
#define SDHC_CA0R_MAXBLKL_1024_Val SDMMC_CA0R_MAXBLKL_1024_Val
#define SDHC_CA0R_MAXBLKL_2048_Val SDMMC_CA0R_MAXBLKL_2048_Val
#define SDHC_CA0R_MAXBLKL_512 SDMMC_CA0R_MAXBLKL_512
#define SDHC_CA0R_MAXBLKL_1024 SDMMC_CA0R_MAXBLKL_1024
#define SDHC_CA0R_MAXBLKL_2048 SDMMC_CA0R_MAXBLKL_2048
#define SDHC_CA0R_ED8SUP_Pos SDMMC_CA0R_ED8SUP_Pos
#define SDHC_CA0R_ED8SUP_Msk SDMMC_CA0R_ED8SUP_Msk
#define SDHC_CA0R_ED8SUP(value) SDMMC_CA0R_ED8SUP(value)
#define SDHC_CA0R_ED8SUP_NO_Val SDMMC_CA0R_ED8SUP_NO_Val
#define SDHC_CA0R_ED8SUP_YES_Val SDMMC_CA0R_ED8SUP_YES_Val
#define SDHC_CA0R_ED8SUP_NO SDMMC_CA0R_ED8SUP_NO
#define SDHC_CA0R_ED8SUP_YES SDMMC_CA0R_ED8SUP_YES
#define SDHC_CA0R_ADMA2SUP_Pos SDMMC_CA0R_ADMA2SUP_Pos
#define SDHC_CA0R_ADMA2SUP_Msk SDMMC_CA0R_ADMA2SUP_Msk
#define SDHC_CA0R_ADMA2SUP(value) SDMMC_CA0R_ADMA2SUP(value)
#define SDHC_CA0R_ADMA2SUP_NO_Val SDMMC_CA0R_ADMA2SUP_NO_Val
#define SDHC_CA0R_ADMA2SUP_YES_Val SDMMC_CA0R_ADMA2SUP_YES_Val
#define SDHC_CA0R_ADMA2SUP_NO SDMMC_CA0R_ADMA2SUP_NO
#define SDHC_CA0R_ADMA2SUP_YES SDMMC_CA0R_ADMA2SUP_YES
#define SDHC_CA0R_HSSUP_Pos SDMMC_CA0R_HSSUP_Pos
#define SDHC_CA0R_HSSUP_Msk SDMMC_CA0R_HSSUP_Msk
#define SDHC_CA0R_HSSUP(value) SDMMC_CA0R_HSSUP(value)
#define SDHC_CA0R_HSSUP_NO_Val SDMMC_CA0R_HSSUP_NO_Val
#define SDHC_CA0R_HSSUP_YES_Val SDMMC_CA0R_HSSUP_YES_Val
#define SDHC_CA0R_HSSUP_NO SDMMC_CA0R_HSSUP_NO
#define SDHC_CA0R_HSSUP_YES SDMMC_CA0R_HSSUP_YES
#define SDHC_CA0R_SDMASUP_Pos SDMMC_CA0R_SDMASUP_Pos
#define SDHC_CA0R_SDMASUP_Msk SDMMC_CA0R_SDMASUP_Msk
#define SDHC_CA0R_SDMASUP(value) SDMMC_CA0R_SDMASUP(value)
#define SDHC_CA0R_SDMASUP_NO_Val SDMMC_CA0R_SDMASUP_NO_Val
#define SDHC_CA0R_SDMASUP_YES_Val SDMMC_CA0R_SDMASUP_YES_Val
#define SDHC_CA0R_SDMASUP_NO SDMMC_CA0R_SDMASUP_NO
#define SDHC_CA0R_SDMASUP_YES SDMMC_CA0R_SDMASUP_YES
#define SDHC_CA0R_SRSUP_Pos SDMMC_CA0R_SRSUP_Pos
#define SDHC_CA0R_SRSUP_Msk SDMMC_CA0R_SRSUP_Msk
#define SDHC_CA0R_SRSUP(value) SDMMC_CA0R_SRSUP(value)
#define SDHC_CA0R_SRSUP_NO_Val SDMMC_CA0R_SRSUP_NO_Val
#define SDHC_CA0R_SRSUP_YES_Val SDMMC_CA0R_SRSUP_YES_Val
#define SDHC_CA0R_SRSUP_NO SDMMC_CA0R_SRSUP_NO
#define SDHC_CA0R_SRSUP_YES SDMMC_CA0R_SRSUP_YES
#define SDHC_CA0R_V33VSUP_Pos SDMMC_CA0R_V33VSUP_Pos
#define SDHC_CA0R_V33VSUP_Msk SDMMC_CA0R_V33VSUP_Msk
#define SDHC_CA0R_V33VSUP(value) SDMMC_CA0R_V33VSUP(value)
#define SDHC_CA0R_V33VSUP_NO_Val SDMMC_CA0R_V33VSUP_NO_Val
#define SDHC_CA0R_V33VSUP_YES_Val SDMMC_CA0R_V33VSUP_YES_Val
#define SDHC_CA0R_V33VSUP_NO SDMMC_CA0R_V33VSUP_NO
#define SDHC_CA0R_V33VSUP_YES SDMMC_CA0R_V33VSUP_YES
#define SDHC_CA0R_V30VSUP_Pos SDMMC_CA0R_V30VSUP_Pos
#define SDHC_CA0R_V30VSUP_Msk SDMMC_CA0R_V30VSUP_Msk
#define SDHC_CA0R_V30VSUP(value) SDMMC_CA0R_V30VSUP(value)
#define SDHC_CA0R_V30VSUP_NO_Val SDMMC_CA0R_V30VSUP_NO_Val
#define SDHC_CA0R_V30VSUP_YES_Val SDMMC_CA0R_V30VSUP_YES_Val
#define SDHC_CA0R_V30VSUP_NO SDMMC_CA0R_V30VSUP_NO
#define SDHC_CA0R_V30VSUP_YES SDMMC_CA0R_V30VSUP_YES
#define SDHC_CA0R_V18VSUP_Pos SDMMC_CA0R_V18VSUP_Pos
#define SDHC_CA0R_V18VSUP_Msk SDMMC_CA0R_V18VSUP_Msk
#define SDHC_CA0R_V18VSUP(value) SDMMC_CA0R_V18VSUP(value)
#define SDHC_CA0R_V18VSUP_NO_Val SDMMC_CA0R_V18VSUP_NO_Val
#define SDHC_CA0R_V18VSUP_YES_Val SDMMC_CA0R_V18VSUP_YES_Val
#define SDHC_CA0R_V18VSUP_NO SDMMC_CA0R_V18VSUP_NO
#define SDHC_CA0R_V18VSUP_YES SDMMC_CA0R_V18VSUP_YES
#define SDHC_CA0R_SB64SUP_Pos SDMMC_CA0R_SB64SUP_Pos
#define SDHC_CA0R_SB64SUP_Msk SDMMC_CA0R_SB64SUP_Msk
#define SDHC_CA0R_SB64SUP(value) SDMMC_CA0R_SB64SUP(value)
#define SDHC_CA0R_SB64SUP_NO_Val SDMMC_CA0R_SB64SUP_NO_Val
#define SDHC_CA0R_SB64SUP_YES_Val SDMMC_CA0R_SB64SUP_YES_Val
#define SDHC_CA0R_SB64SUP_NO SDMMC_CA0R_SB64SUP_NO
#define SDHC_CA0R_SB64SUP_YES SDMMC_CA0R_SB64SUP_YES
#define SDHC_CA0R_ASINTSUP_Pos SDMMC_CA0R_ASINTSUP_Pos
#define SDHC_CA0R_ASINTSUP_Msk SDMMC_CA0R_ASINTSUP_Msk
#define SDHC_CA0R_ASINTSUP(value) SDMMC_CA0R_ASINTSUP(value)
#define SDHC_CA0R_ASINTSUP_NO_Val SDMMC_CA0R_ASINTSUP_NO_Val
#define SDHC_CA0R_ASINTSUP_YES_Val SDMMC_CA0R_ASINTSUP_YES_Val
#define SDHC_CA0R_ASINTSUP_NO SDMMC_CA0R_ASINTSUP_NO
#define SDHC_CA0R_ASINTSUP_YES SDMMC_CA0R_ASINTSUP_YES
#define SDHC_CA0R_SLTYPE_Pos SDMMC_CA0R_SLTYPE_Pos
#define SDHC_CA0R_SLTYPE_Msk SDMMC_CA0R_SLTYPE_Msk
#define SDHC_CA0R_SLTYPE(value) SDMMC_CA0R_SLTYPE(value)
#define SDHC_CA0R_SLTYPE_REMOVABLE_Val SDMMC_CA0R_SLTYPE_REMOVABLE_Val
#define SDHC_CA0R_SLTYPE_EMBEDDED_Val SDMMC_CA0R_SLTYPE_EMBEDDED_Val
#define SDHC_CA0R_SLTYPE_REMOVABLE SDMMC_CA0R_SLTYPE_REMOVABLE
#define SDHC_CA0R_SLTYPE_EMBEDDED SDMMC_CA0R_SLTYPE_EMBEDDED
#define SDHC_CA0R_Msk SDMMC_CA0R_Msk

/* SDHC_CA1R : (SDMMC Offset: 0x44) (R/W 32) Capabilities 1 */
#define SDHC_CA1R_RESETVALUE SDMMC_CA1R_RESETVALUE

#define SDHC_CA1R_SDR50SUP_Pos SDMMC_CA1R_SDR50SUP_Pos
#define SDHC_CA1R_SDR50SUP_Msk SDMMC_CA1R_SDR50SUP_Msk
#define SDHC_CA1R_SDR50SUP(value) SDMMC_CA1R_SDR50SUP(value)
#define SDHC_CA1R_SDR50SUP_NO_Val SDMMC_CA1R_SDR50SUP_NO_Val
#define SDHC_CA1R_SDR50SUP_YES_Val SDMMC_CA1R_SDR50SUP_YES_Val
#define SDHC_CA1R_SDR50SUP_NO SDMMC_CA1R_SDR50SUP_NO
#define SDHC_CA1R_SDR50SUP_YES SDMMC_CA1R_SDR50SUP_YES
#define SDHC_CA1R_SDR104SUP_Pos SDMMC_CA1R_SDR104SUP_Pos
#define SDHC_CA1R_SDR104SUP_Msk SDMMC_CA1R_SDR104SUP_Msk
#define SDHC_CA1R_SDR104SUP(value) SDMMC_CA1R_SDR104SUP(value)
#define SDHC_CA1R_SDR104SUP_NO_Val SDMMC_CA1R_SDR104SUP_NO_Val
#define SDHC_CA1R_SDR104SUP_YES_Val SDMMC_CA1R_SDR104SUP_YES_Val
#define SDHC_CA1R_SDR104SUP_NO SDMMC_CA1R_SDR104SUP_NO
#define SDHC_CA1R_SDR104SUP_YES SDMMC_CA1R_SDR104SUP_YES
#define SDHC_CA1R_DDR50SUP_Pos SDMMC_CA1R_DDR50SUP_Pos
#define SDHC_CA1R_DDR50SUP_Msk SDMMC_CA1R_DDR50SUP_Msk
#define SDHC_CA1R_DDR50SUP(value) SDMMC_CA1R_DDR50SUP(value)
#define SDHC_CA1R_DDR50SUP_NO_Val SDMMC_CA1R_DDR50SUP_NO_Val
#define SDHC_CA1R_DDR50SUP_YES_Val SDMMC_CA1R_DDR50SUP_YES_Val
#define SDHC_CA1R_DDR50SUP_NO SDMMC_CA1R_DDR50SUP_NO
#define SDHC_CA1R_DDR50SUP_YES SDMMC_CA1R_DDR50SUP_YES
#define SDHC_CA1R_DRVASUP_Pos SDMMC_CA1R_DRVASUP_Pos
#define SDHC_CA1R_DRVASUP_Msk SDMMC_CA1R_DRVASUP_Msk
#define SDHC_CA1R_DRVASUP(value) SDMMC_CA1R_DRVASUP(value)
#define SDHC_CA1R_DRVASUP_NO_Val SDMMC_CA1R_DRVASUP_NO_Val
#define SDHC_CA1R_DRVASUP_YES_Val SDMMC_CA1R_DRVASUP_YES_Val
#define SDHC_CA1R_DRVASUP_NO SDMMC_CA1R_DRVASUP_NO
#define SDHC_CA1R_DRVASUP_YES SDMMC_CA1R_DRVASUP_YES
#define SDHC_CA1R_DRVCSUP_Pos SDMMC_CA1R_DRVCSUP_Pos
#define SDHC_CA1R_DRVCSUP_Msk SDMMC_CA1R_DRVCSUP_Msk
#define SDHC_CA1R_DRVCSUP(value) SDMMC_CA1R_DRVCSUP(value)
#define SDHC_CA1R_DRVCSUP_NO_Val SDMMC_CA1R_DRVCSUP_NO_Val
#define SDHC_CA1R_DRVCSUP_YES_Val SDMMC_CA1R_DRVCSUP_YES_Val
#define SDHC_CA1R_DRVCSUP_NO SDMMC_CA1R_DRVCSUP_NO
#define SDHC_CA1R_DRVCSUP_YES SDMMC_CA1R_DRVCSUP_YES
#define SDHC_CA1R_DRVDSUP_Pos SDMMC_CA1R_DRVDSUP_Pos
#define SDHC_CA1R_DRVDSUP_Msk SDMMC_CA1R_DRVDSUP_Msk
#define SDHC_CA1R_DRVDSUP(value) SDMMC_CA1R_DRVDSUP(value)
#define SDHC_CA1R_DRVDSUP_NO_Val SDMMC_CA1R_DRVDSUP_NO_Val
#define SDHC_CA1R_DRVDSUP_YES_Val SDMMC_CA1R_DRVDSUP_YES_Val
#define SDHC_CA1R_DRVDSUP_NO SDMMC_CA1R_DRVDSUP_NO
#define SDHC_CA1R_DRVDSUP_YES SDMMC_CA1R_DRVDSUP_YES
#define SDHC_CA1R_TCNTRT_Pos SDMMC_CA1R_TCNTRT_Pos
#define SDHC_CA1R_TCNTRT_Msk SDMMC_CA1R_TCNTRT_Msk
#define SDHC_CA1R_TCNTRT(value) SDMMC_CA1R_TCNTRT(value)
#define SDHC_CA1R_TCNTRT_DISABLED_Val SDMMC_CA1R_TCNTRT_DISABLED_Val
#define SDHC_CA1R_TCNTRT_1S_Val SDMMC_CA1R_TCNTRT_1S_Val
#define SDHC_CA1R_TCNTRT_2S_Val SDMMC_CA1R_TCNTRT_2S_Val
#define SDHC_CA1R_TCNTRT_4S_Val SDMMC_CA1R_TCNTRT_4S_Val
#define SDHC_CA1R_TCNTRT_8S_Val SDMMC_CA1R_TCNTRT_8S_Val
#define SDHC_CA1R_TCNTRT_16S_Val SDMMC_CA1R_TCNTRT_16S_Val
#define SDHC_CA1R_TCNTRT_32S_Val SDMMC_CA1R_TCNTRT_32S_Val
#define SDHC_CA1R_TCNTRT_64S_Val SDMMC_CA1R_TCNTRT_64S_Val
#define SDHC_CA1R_TCNTRT_128S_Val SDMMC_CA1R_TCNTRT_128S_Val
#define SDHC_CA1R_TCNTRT_256S_Val SDMMC_CA1R_TCNTRT_256S_Val
#define SDHC_CA1R_TCNTRT_512S_Val SDMMC_CA1R_TCNTRT_512S_Val
#define SDHC_CA1R_TCNTRT_1024S_Val SDMMC_CA1R_TCNTRT_1024S_Val
#define SDHC_CA1R_TCNTRT_OTHER_Val SDMMC_CA1R_TCNTRT_OTHER_Val
#define SDHC_CA1R_TCNTRT_DISABLED SDMMC_CA1R_TCNTRT_DISABLED
#define SDHC_CA1R_TCNTRT_1S SDMMC_CA1R_TCNTRT_1S
#define SDHC_CA1R_TCNTRT_2S SDMMC_CA1R_TCNTRT_2S
#define SDHC_CA1R_TCNTRT_4S SDMMC_CA1R_TCNTRT_4S
#define SDHC_CA1R_TCNTRT_8S SDMMC_CA1R_TCNTRT_8S
#define SDHC_CA1R_TCNTRT_16S SDMMC_CA1R_TCNTRT_16S
#define SDHC_CA1R_TCNTRT_32S SDMMC_CA1R_TCNTRT_32S
#define SDHC_CA1R_TCNTRT_64S SDMMC_CA1R_TCNTRT_64S
#define SDHC_CA1R_TCNTRT_128S SDMMC_CA1R_TCNTRT_128S
#define SDHC_CA1R_TCNTRT_256S SDMMC_CA1R_TCNTRT_256S
#define SDHC_CA1R_TCNTRT_512S SDMMC_CA1R_TCNTRT_512S
#define SDHC_CA1R_TCNTRT_1024S SDMMC_CA1R_TCNTRT_1024S
#define SDHC_CA1R_TCNTRT_OTHER SDMMC_CA1R_TCNTRT_OTHER
#define SDHC_CA1R_TSDR50_Pos SDMMC_CA1R_TSDR50_Pos
#define SDHC_CA1R_TSDR50_Msk SDMMC_CA1R_TSDR50_Msk
#define SDHC_CA1R_TSDR50(value) SDMMC_CA1R_TSDR50(value)
#define SDHC_CA1R_TSDR50_NO_Val SDMMC_CA1R_TSDR50_NO_Val
#define SDHC_CA1R_TSDR50_YES_Val SDMMC_CA1R_TSDR50_YES_Val
#define SDHC_CA1R_TSDR50_NO SDMMC_CA1R_TSDR50_NO
#define SDHC_CA1R_TSDR50_YES SDMMC_CA1R_TSDR50_YES
#define SDHC_CA1R_CLKMULT_Pos SDMMC_CA1R_CLKMULT_Pos
#define SDHC_CA1R_CLKMULT_Msk SDMMC_CA1R_CLKMULT_Msk
#define SDHC_CA1R_CLKMULT(value) SDMMC_CA1R_CLKMULT(value)
#define SDHC_CA1R_CLKMULT_NO_Val SDMMC_CA1R_CLKMULT_NO_Val
#define SDHC_CA1R_CLKMULT_NO SDMMC_CA1R_CLKMULT_NO
#define SDHC_CA1R_Msk SDMMC_CA1R_Msk

#define SDHC_CA1R_TSDR_Pos SDMMC_CA1R_TSDR_Pos
#define SDHC_CA1R_TSDR_Msk SDMMC_CA1R_TSDR_Msk
#define SDHC_CA1R_TSDR(value) SDMMC_CA1R_TSDR(value)

/* SDHC_MCCAR : (SDMMC Offset: 0x48) ( R/ 32) Maximum Current Capabilities */
#define SDHC_MCCAR_RESETVALUE SDMMC_MCCAR_RESETVALUE

