Zephyr4Microchip/microchip-hal/packs/pic32c/pic32ck_sg_gc/common/sdhc_pic32ck_sg_gc.h
#define SDHC_MCCAR_MAXCUR33V_Pos SDMMC_MCCAR_MAXCUR33V_Pos
#define SDHC_MCCAR_MAXCUR33V_Msk SDMMC_MCCAR_MAXCUR33V_Msk
#define SDHC_MCCAR_MAXCUR33V(value) SDMMC_MCCAR_MAXCUR33V(value)
#define SDHC_MCCAR_MAXCUR33V_OTHER_Val SDMMC_MCCAR_MAXCUR33V_OTHER_Val
#define SDHC_MCCAR_MAXCUR33V_4MA_Val SDMMC_MCCAR_MAXCUR33V_4MA_Val
#define SDHC_MCCAR_MAXCUR33V_8MA_Val SDMMC_MCCAR_MAXCUR33V_8MA_Val
#define SDHC_MCCAR_MAXCUR33V_12MA_Val SDMMC_MCCAR_MAXCUR33V_12MA_Val
#define SDHC_MCCAR_MAXCUR33V_OTHER SDMMC_MCCAR_MAXCUR33V_OTHER
#define SDHC_MCCAR_MAXCUR33V_4MA SDMMC_MCCAR_MAXCUR33V_4MA
#define SDHC_MCCAR_MAXCUR33V_8MA SDMMC_MCCAR_MAXCUR33V_8MA
#define SDHC_MCCAR_MAXCUR33V_12MA SDMMC_MCCAR_MAXCUR33V_12MA
#define SDHC_MCCAR_MAXCUR30V_Pos SDMMC_MCCAR_MAXCUR30V_Pos
#define SDHC_MCCAR_MAXCUR30V_Msk SDMMC_MCCAR_MAXCUR30V_Msk
#define SDHC_MCCAR_MAXCUR30V(value) SDMMC_MCCAR_MAXCUR30V(value)
#define SDHC_MCCAR_MAXCUR30V_OTHER_Val SDMMC_MCCAR_MAXCUR30V_OTHER_Val
#define SDHC_MCCAR_MAXCUR30V_4MA_Val SDMMC_MCCAR_MAXCUR30V_4MA_Val
#define SDHC_MCCAR_MAXCUR30V_8MA_Val SDMMC_MCCAR_MAXCUR30V_8MA_Val
#define SDHC_MCCAR_MAXCUR30V_12MA_Val SDMMC_MCCAR_MAXCUR30V_12MA_Val
#define SDHC_MCCAR_MAXCUR30V_OTHER SDMMC_MCCAR_MAXCUR30V_OTHER
#define SDHC_MCCAR_MAXCUR30V_4MA SDMMC_MCCAR_MAXCUR30V_4MA
#define SDHC_MCCAR_MAXCUR30V_8MA SDMMC_MCCAR_MAXCUR30V_8MA
#define SDHC_MCCAR_MAXCUR30V_12MA SDMMC_MCCAR_MAXCUR30V_12MA
#define SDHC_MCCAR_MAXCUR18V_Pos SDMMC_MCCAR_MAXCUR18V_Pos
#define SDHC_MCCAR_MAXCUR18V_Msk SDMMC_MCCAR_MAXCUR18V_Msk
#define SDHC_MCCAR_MAXCUR18V(value) SDMMC_MCCAR_MAXCUR18V(value)
#define SDHC_MCCAR_MAXCUR18V_OTHER_Val SDMMC_MCCAR_MAXCUR18V_OTHER_Val
#define SDHC_MCCAR_MAXCUR18V_4MA_Val SDMMC_MCCAR_MAXCUR18V_4MA_Val
#define SDHC_MCCAR_MAXCUR18V_8MA_Val SDMMC_MCCAR_MAXCUR18V_8MA_Val
#define SDHC_MCCAR_MAXCUR18V_12MA_Val SDMMC_MCCAR_MAXCUR18V_12MA_Val
#define SDHC_MCCAR_MAXCUR18V_OTHER SDMMC_MCCAR_MAXCUR18V_OTHER
#define SDHC_MCCAR_MAXCUR18V_4MA SDMMC_MCCAR_MAXCUR18V_4MA
#define SDHC_MCCAR_MAXCUR18V_8MA SDMMC_MCCAR_MAXCUR18V_8MA
#define SDHC_MCCAR_MAXCUR18V_12MA SDMMC_MCCAR_MAXCUR18V_12MA
#define SDHC_MCCAR_Msk SDMMC_MCCAR_Msk

/* SDHC_FERACES : (SDMMC Offset: 0x50) ( /W 16) Force Event for
 * Auto CMD Error Status
 */
#define SDHC_FERACES_RESETVALUE SDMMC_FERACES_RESETVALUE

#define SDHC_FERACES_ACMD12NE_Pos SDMMC_FERACES_ACMD12NE_Pos
#define SDHC_FERACES_ACMD12NE_Msk SDMMC_FERACES_ACMD12NE_Msk
#define SDHC_FERACES_ACMD12NE(value) SDMMC_FERACES_ACMD12NE(value)
#define SDHC_FERACES_ACMD12NE_NO_Val SDMMC_FERACES_ACMD12NE_NO_Val
#define SDHC_FERACES_ACMD12NE_YES_Val SDMMC_FERACES_ACMD12NE_YES_Val
#define SDHC_FERACES_ACMD12NE_NO SDMMC_FERACES_ACMD12NE_NO
#define SDHC_FERACES_ACMD12NE_YES SDMMC_FERACES_ACMD12NE_YES
#define SDHC_FERACES_ACMDTEO_Pos SDMMC_FERACES_ACMDTEO_Pos
#define SDHC_FERACES_ACMDTEO_Msk SDMMC_FERACES_ACMDTEO_Msk
#define SDHC_FERACES_ACMDTEO(value) SDMMC_FERACES_ACMDTEO(value)
#define SDHC_FERACES_ACMDTEO_NO_Val SDMMC_FERACES_ACMDTEO_NO_Val
#define SDHC_FERACES_ACMDTEO_YES_Val SDMMC_FERACES_ACMDTEO_YES_Val
#define SDHC_FERACES_ACMDTEO_NO SDMMC_FERACES_ACMDTEO_NO
#define SDHC_FERACES_ACMDTEO_YES SDMMC_FERACES_ACMDTEO_YES
#define SDHC_FERACES_ACMDCRC_Pos SDMMC_FERACES_ACMDCRC_Pos
#define SDHC_FERACES_ACMDCRC_Msk SDMMC_FERACES_ACMDCRC_Msk
#define SDHC_FERACES_ACMDCRC(value) SDMMC_FERACES_ACMDCRC(value)
#define SDHC_FERACES_ACMDCRC_NO_Val SDMMC_FERACES_ACMDCRC_NO_Val
#define SDHC_FERACES_ACMDCRC_YES_Val SDMMC_FERACES_ACMDCRC_YES_Val
#define SDHC_FERACES_ACMDCRC_NO SDMMC_FERACES_ACMDCRC_NO
#define SDHC_FERACES_ACMDCRC_YES SDMMC_FERACES_ACMDCRC_YES
#define SDHC_FERACES_ACMDEND_Pos SDMMC_FERACES_ACMDEND_Pos
#define SDHC_FERACES_ACMDEND_Msk SDMMC_FERACES_ACMDEND_Msk
#define SDHC_FERACES_ACMDEND(value) SDMMC_FERACES_ACMDEND(value)
#define SDHC_FERACES_ACMDEND_NO_Val SDMMC_FERACES_ACMDEND_NO_Val
#define SDHC_FERACES_ACMDEND_YES_Val SDMMC_FERACES_ACMDEND_YES_Val
#define SDHC_FERACES_ACMDEND_NO SDMMC_FERACES_ACMDEND_NO
#define SDHC_FERACES_ACMDEND_YES SDMMC_FERACES_ACMDEND_YES
#define SDHC_FERACES_ACMDIDX_Pos SDMMC_FERACES_ACMDIDX_Pos
#define SDHC_FERACES_ACMDIDX_Msk SDMMC_FERACES_ACMDIDX_Msk
#define SDHC_FERACES_ACMDIDX(value) SDMMC_FERACES_ACMDIDX(value)
#define SDHC_FERACES_ACMDIDX_NO_Val SDMMC_FERACES_ACMDIDX_NO_Val
#define SDHC_FERACES_ACMDIDX_YES_Val SDMMC_FERACES_ACMDIDX_YES_Val
#define SDHC_FERACES_ACMDIDX_NO SDMMC_FERACES_ACMDIDX_NO
#define SDHC_FERACES_ACMDIDX_YES SDMMC_FERACES_ACMDIDX_YES
#define SDHC_FERACES_CMDNI_Pos SDMMC_FERACES_CMDNI_Pos
#define SDHC_FERACES_CMDNI_Msk SDMMC_FERACES_CMDNI_Msk
#define SDHC_FERACES_CMDNI(value) SDMMC_FERACES_CMDNI(value)
#define SDHC_FERACES_CMDNI_NO_Val SDMMC_FERACES_CMDNI_NO_Val
#define SDHC_FERACES_CMDNI_YES_Val SDMMC_FERACES_CMDNI_YES_Val
#define SDHC_FERACES_CMDNI_NO SDMMC_FERACES_CMDNI_NO
#define SDHC_FERACES_CMDNI_YES SDMMC_FERACES_CMDNI_YES
#define SDHC_FERACES_Msk SDMMC_FERACES_Msk

/* SDHC_FEREIS : (SDMMC Offset: 0x52) ( /W 16) Force Event for
 * Error Interrupt Status
 */
#define SDHC_FEREIS_RESETVALUE SDMMC_FEREIS_RESETVALUE

#define SDHC_FEREIS_CMDTEO_Pos SDMMC_FEREIS_CMDTEO_Pos
#define SDHC_FEREIS_CMDTEO_Msk SDMMC_FEREIS_CMDTEO_Msk
#define SDHC_FEREIS_CMDTEO(value) SDMMC_FEREIS_CMDTEO(value)
#define SDHC_FEREIS_CMDTEO_NO_Val SDMMC_FEREIS_CMDTEO_NO_Val
#define SDHC_FEREIS_CMDTEO_YES_Val SDMMC_FEREIS_CMDTEO_YES_Val
#define SDHC_FEREIS_CMDTEO_NO SDMMC_FEREIS_CMDTEO_NO
#define SDHC_FEREIS_CMDTEO_YES SDMMC_FEREIS_CMDTEO_YES
#define SDHC_FEREIS_CMDCRC_Pos SDMMC_FEREIS_CMDCRC_Pos
#define SDHC_FEREIS_CMDCRC_Msk SDMMC_FEREIS_CMDCRC_Msk
#define SDHC_FEREIS_CMDCRC(value) SDMMC_FEREIS_CMDCRC(value)
#define SDHC_FEREIS_CMDCRC_NO_Val SDMMC_FEREIS_CMDCRC_NO_Val
#define SDHC_FEREIS_CMDCRC_YES_Val SDMMC_FEREIS_CMDCRC_YES_Val
#define SDHC_FEREIS_CMDCRC_NO SDMMC_FEREIS_CMDCRC_NO
#define SDHC_FEREIS_CMDCRC_YES SDMMC_FEREIS_CMDCRC_YES
#define SDHC_FEREIS_CMDEND_Pos SDMMC_FEREIS_CMDEND_Pos
#define SDHC_FEREIS_CMDEND_Msk SDMMC_FEREIS_CMDEND_Msk
#define SDHC_FEREIS_CMDEND(value) SDMMC_FEREIS_CMDEND(value)
#define SDHC_FEREIS_CMDEND_NO_Val SDMMC_FEREIS_CMDEND_NO_Val
#define SDHC_FEREIS_CMDEND_YES_Val SDMMC_FEREIS_CMDEND_YES_Val
#define SDHC_FEREIS_CMDEND_NO SDMMC_FEREIS_CMDEND_NO
#define SDHC_FEREIS_CMDEND_YES SDMMC_FEREIS_CMDEND_YES
#define SDHC_FEREIS_CMDIDX_Pos SDMMC_FEREIS_CMDIDX_Pos
#define SDHC_FEREIS_CMDIDX_Msk SDMMC_FEREIS_CMDIDX_Msk
#define SDHC_FEREIS_CMDIDX(value) SDMMC_FEREIS_CMDIDX(value)
#define SDHC_FEREIS_CMDIDX_NO_Val SDMMC_FEREIS_CMDIDX_NO_Val
#define SDHC_FEREIS_CMDIDX_YES_Val SDMMC_FEREIS_CMDIDX_YES_Val
#define SDHC_FEREIS_CMDIDX_NO SDMMC_FEREIS_CMDIDX_NO
#define SDHC_FEREIS_CMDIDX_YES SDMMC_FEREIS_CMDIDX_YES
#define SDHC_FEREIS_DATTEO_Pos SDMMC_FEREIS_DATTEO_Pos
#define SDHC_FEREIS_DATTEO_Msk SDMMC_FEREIS_DATTEO_Msk
#define SDHC_FEREIS_DATTEO(value) SDMMC_FEREIS_DATTEO(value)
#define SDHC_FEREIS_DATTEO_NO_Val SDMMC_FEREIS_DATTEO_NO_Val
#define SDHC_FEREIS_DATTEO_YES_Val SDMMC_FEREIS_DATTEO_YES_Val
#define SDHC_FEREIS_DATTEO_NO SDMMC_FEREIS_DATTEO_NO
#define SDHC_FEREIS_DATTEO_YES SDMMC_FEREIS_DATTEO_YES
#define SDHC_FEREIS_DATCRC_Pos SDMMC_FEREIS_DATCRC_Pos
#define SDHC_FEREIS_DATCRC_Msk SDMMC_FEREIS_DATCRC_Msk
#define SDHC_FEREIS_DATCRC(value) SDMMC_FEREIS_DATCRC(value)
#define SDHC_FEREIS_DATCRC_NO_Val SDMMC_FEREIS_DATCRC_NO_Val
#define SDHC_FEREIS_DATCRC_YES_Val SDMMC_FEREIS_DATCRC_YES_Val
#define SDHC_FEREIS_DATCRC_NO SDMMC_FEREIS_DATCRC_NO
#define SDHC_FEREIS_DATCRC_YES SDMMC_FEREIS_DATCRC_YES
#define SDHC_FEREIS_DATEND_Pos SDMMC_FEREIS_DATEND_Pos
#define SDHC_FEREIS_DATEND_Msk SDMMC_FEREIS_DATEND_Msk
#define SDHC_FEREIS_DATEND(value) SDMMC_FEREIS_DATEND(value)
#define SDHC_FEREIS_DATEND_NO_Val SDMMC_FEREIS_DATEND_NO_Val
#define SDHC_FEREIS_DATEND_YES_Val SDMMC_FEREIS_DATEND_YES_Val
#define SDHC_FEREIS_DATEND_NO SDMMC_FEREIS_DATEND_NO
#define SDHC_FEREIS_DATEND_YES SDMMC_FEREIS_DATEND_YES
#define SDHC_FEREIS_CURLIM_Pos SDMMC_FEREIS_CURLIM_Pos
#define SDHC_FEREIS_CURLIM_Msk SDMMC_FEREIS_CURLIM_Msk
#define SDHC_FEREIS_CURLIM(value) SDMMC_FEREIS_CURLIM(value)
#define SDHC_FEREIS_CURLIM_NO_Val SDMMC_FEREIS_CURLIM_NO_Val
#define SDHC_FEREIS_CURLIM_YES_Val SDMMC_FEREIS_CURLIM_YES_Val
#define SDHC_FEREIS_CURLIM_NO SDMMC_FEREIS_CURLIM_NO
#define SDHC_FEREIS_CURLIM_YES SDMMC_FEREIS_CURLIM_YES
#define SDHC_FEREIS_ACMD_Pos SDMMC_FEREIS_ACMD_Pos
#define SDHC_FEREIS_ACMD_Msk SDMMC_FEREIS_ACMD_Msk
#define SDHC_FEREIS_ACMD(value) SDMMC_FEREIS_ACMD(value)
#define SDHC_FEREIS_ACMD_NO_Val SDMMC_FEREIS_ACMD_NO_Val
#define SDHC_FEREIS_ACMD_YES_Val SDMMC_FEREIS_ACMD_YES_Val
#define SDHC_FEREIS_ACMD_NO SDMMC_FEREIS_ACMD_NO
#define SDHC_FEREIS_ACMD_YES SDMMC_FEREIS_ACMD_YES
#define SDHC_FEREIS_ADMA_Pos SDMMC_FEREIS_ADMA_Pos
#define SDHC_FEREIS_ADMA_Msk SDMMC_FEREIS_ADMA_Msk
#define SDHC_FEREIS_ADMA(value) SDMMC_FEREIS_ADMA(value)
#define SDHC_FEREIS_ADMA_NO_Val SDMMC_FEREIS_ADMA_NO_Val
#define SDHC_FEREIS_ADMA_YES_Val SDMMC_FEREIS_ADMA_YES_Val
#define SDHC_FEREIS_ADMA_NO SDMMC_FEREIS_ADMA_NO
#define SDHC_FEREIS_ADMA_YES SDMMC_FEREIS_ADMA_YES
#define SDHC_FEREIS_BOOTAE_Pos SDMMC_FEREIS_BOOTAE_Pos
#define SDHC_FEREIS_BOOTAE_Msk SDMMC_FEREIS_BOOTAE_Msk
#define SDHC_FEREIS_BOOTAE(value) SDMMC_FEREIS_BOOTAE(value)
#define SDHC_FEREIS_BOOTAE_NO_Val SDMMC_FEREIS_BOOTAE_NO_Val
#define SDHC_FEREIS_BOOTAE_YES_Val SDMMC_FEREIS_BOOTAE_YES_Val
#define SDHC_FEREIS_BOOTAE_NO SDMMC_FEREIS_BOOTAE_NO
#define SDHC_FEREIS_BOOTAE_YES SDMMC_FEREIS_BOOTAE_YES
#define SDHC_FEREIS_Msk SDMMC_FEREIS_Msk

/* SDHC_AESR : (SDMMC Offset: 0x54) ( R/ 8) ADMA Error Status */
#define SDHC_AESR_RESETVALUE SDMMC_AESR_RESETVALUE

#define SDHC_AESR_ERRST_Pos SDMMC_AESR_ERRST_Pos
#define SDHC_AESR_ERRST_Msk SDMMC_AESR_ERRST_Msk
#define SDHC_AESR_ERRST(value) SDMMC_AESR_ERRST(value)
#define SDHC_AESR_ERRST_STOP_Val SDMMC_AESR_ERRST_STOP_Val
#define SDHC_AESR_ERRST_FDS_Val SDMMC_AESR_ERRST_FDS_Val
#define SDHC_AESR_ERRST_TFR_Val SDMMC_AESR_ERRST_TFR_Val
#define SDHC_AESR_ERRST_STOP SDMMC_AESR_ERRST_STOP
#define SDHC_AESR_ERRST_FDS SDMMC_AESR_ERRST_FDS
#define SDHC_AESR_ERRST_TFR SDMMC_AESR_ERRST_TFR
#define SDHC_AESR_LMIS_Pos SDMMC_AESR_LMIS_Pos
#define SDHC_AESR_LMIS_Msk SDMMC_AESR_LMIS_Msk
#define SDHC_AESR_LMIS(value) SDMMC_AESR_LMIS(value)
#define SDHC_AESR_LMIS_NO_Val SDMMC_AESR_LMIS_NO_Val
#define SDHC_AESR_LMIS_YES_Val SDMMC_AESR_LMIS_YES_Val
#define SDHC_AESR_LMIS_NO SDMMC_AESR_LMIS_NO
#define SDHC_AESR_LMIS_YES SDMMC_AESR_LMIS_YES
#define SDHC_AESR_Msk SDMMC_AESR_Msk

/* SDHC_ASAR : (SDMMC Offset: 0x58) (R/W 32) ADMA System Address n */
#define SDHC_ASAR_RESETVALUE SDMMC_ASAR_RESETVALUE

#define SDHC_ASAR_ADMASA_Pos SDMMC_ASAR_ADMASA_Pos
#define SDHC_ASAR_ADMASA_Msk SDMMC_ASAR_ADMASA_Msk
#define SDHC_ASAR_ADMASA(value) SDMMC_ASAR_ADMASA(value)
#define SDHC_ASAR_Msk SDMMC_ASAR_Msk

/* SDHC_PVR : (SDMMC Offset: 0x60) (R/W 16) Preset Value n */
#define SDHC_PVR_RESETVALUE SDMMC_PVR_RESETVALUE

#define SDHC_PVR_SDCLKFSEL_Pos SDMMC_PVR_SDCLKFSEL_Pos
#define SDHC_PVR_SDCLKFSEL_Msk SDMMC_PVR_SDCLKFSEL_Msk
#define SDHC_PVR_SDCLKFSEL(value) SDMMC_PVR_SDCLKFSEL(value)
#define SDHC_PVR_CLKGSEL_Pos SDMMC_PVR_CLKGSEL_Pos
#define SDHC_PVR_CLKGSEL_Msk SDMMC_PVR_CLKGSEL_Msk
#define SDHC_PVR_CLKGSEL(value) SDMMC_PVR_CLKGSEL(value)
#define SDHC_PVR_CLKGSEL_DIV_Val SDMMC_PVR_CLKGSEL_DIV_Val
#define SDHC_PVR_CLKGSEL_PROG_Val SDMMC_PVR_CLKGSEL_PROG_Val
#define SDHC_PVR_CLKGSEL_DIV SDMMC_PVR_CLKGSEL_DIV
#define SDHC_PVR_CLKGSEL_PROG SDMMC_PVR_CLKGSEL_PROG
#define SDHC_PVR_DRVSEL_Pos SDMMC_PVR_DRVSEL_Pos
#define SDHC_PVR_DRVSEL_Msk SDMMC_PVR_DRVSEL_Msk
#define SDHC_PVR_DRVSEL(value) SDMMC_PVR_DRVSEL(value)
#define SDHC_PVR_DRVSEL_B_Val SDMMC_PVR_DRVSEL_B_Val
#define SDHC_PVR_DRVSEL_A_Val SDMMC_PVR_DRVSEL_A_Val
#define SDHC_PVR_DRVSEL_C_Val SDMMC_PVR_DRVSEL_C_Val
#define SDHC_PVR_DRVSEL_D_Val SDMMC_PVR_DRVSEL_D_Val
#define SDHC_PVR_DRVSEL_B SDMMC_PVR_DRVSEL_B
#define SDHC_PVR_DRVSEL_A SDMMC_PVR_DRVSEL_A
#define SDHC_PVR_DRVSEL_C SDMMC_PVR_DRVSEL_C
#define SDHC_PVR_DRVSEL_D SDMMC_PVR_DRVSEL_D
#define SDHC_PVR_Msk SDMMC_PVR_Msk

/* SDHC_SISR : (SDMMC Offset: 0xFC) ( R/ 16) Slot Interrupt Status */
#define SDHC_SISR_RESETVALUE SDMMC_SISR_RESETVALUE

#define SDHC_SISR_INTSSL_Pos SDMMC_SISR_INTSSL_Pos
#define SDHC_SISR_INTSSL_Msk SDMMC_SISR_INTSSL_Msk
#define SDHC_SISR_INTSSL(value) SDMMC_SISR_INTSSL(value)
#define SDHC_SISR_Msk SDMMC_SISR_Msk

/* SDHC_HCVR : (SDMMC Offset: 0xFE) ( R/ 16) Host Controller Version */
#define SDHC_HCVR_RESETVALUE SDMMC_HCVR_RESETVALUE

#define SDHC_HCVR_SVER_Pos SDMMC_HCVR_SVER_Pos
#define SDHC_HCVR_SVER_Msk SDMMC_HCVR_SVER_Msk
#define SDHC_HCVR_SVER(value) SDMMC_HCVR_SVER(value)
#define SDHC_HCVR_VVER_Pos SDMMC_HCVR_VVER_Pos
#define SDHC_HCVR_VVER_Msk SDMMC_HCVR_VVER_Msk
#define SDHC_HCVR_VVER(value) SDMMC_HCVR_VVER(value)
#define SDHC_HCVR_Msk SDMMC_HCVR_Msk

