Zephyr4Microchip/microchip-hal/packs/pic32c/pic32ck_sg_gc/common/sdhc_pic32ck_sg_gc.h
/* SDHC_MC1R : (SDMMC Offset: 0x204) (R/W 8) e.MMC Control 1 */
#define SDHC_MC1R_RESETVALUE SDMMC_MC1R_RESETVALUE

#define SDHC_MC1R_CMDTYP_Pos SDMMC_MC1R_CMDTYP_Pos
#define SDHC_MC1R_CMDTYP_Msk SDMMC_MC1R_CMDTYP_Msk
#define SDHC_MC1R_CMDTYP(value) SDMMC_MC1R_CMDTYP(value)
#define SDHC_MC1R_CMDTYP_NORMAL_Val SDMMC_MC1R_CMDTYP_NORMAL_Val
#define SDHC_MC1R_CMDTYP_WAITIRQ_Val SDMMC_MC1R_CMDTYP_WAITIRQ_Val
#define SDHC_MC1R_CMDTYP_STREAM_Val SDMMC_MC1R_CMDTYP_STREAM_Val
#define SDHC_MC1R_CMDTYP_BOOT_Val SDMMC_MC1R_CMDTYP_BOOT_Val
#define SDHC_MC1R_CMDTYP_NORMAL SDMMC_MC1R_CMDTYP_NORMAL
#define SDHC_MC1R_CMDTYP_WAITIRQ SDMMC_MC1R_CMDTYP_WAITIRQ
#define SDHC_MC1R_CMDTYP_STREAM SDMMC_MC1R_CMDTYP_STREAM
#define SDHC_MC1R_CMDTYP_BOOT SDMMC_MC1R_CMDTYP_BOOT
#define SDHC_MC1R_DDR_Pos SDMMC_MC1R_DDR_Pos
#define SDHC_MC1R_DDR_Msk SDMMC_MC1R_DDR_Msk
#define SDHC_MC1R_DDR(value) SDMMC_MC1R_DDR(value)
#define SDHC_MC1R_OPD_Pos SDMMC_MC1R_OPD_Pos
#define SDHC_MC1R_OPD_Msk SDMMC_MC1R_OPD_Msk
#define SDHC_MC1R_OPD(value) SDMMC_MC1R_OPD(value)
#define SDHC_MC1R_BOOTA_Pos SDMMC_MC1R_BOOTA_Pos
#define SDHC_MC1R_BOOTA_Msk SDMMC_MC1R_BOOTA_Msk
#define SDHC_MC1R_BOOTA(value) SDMMC_MC1R_BOOTA(value)
#define SDHC_MC1R_RSTN_Pos SDMMC_MC1R_RSTN_Pos
#define SDHC_MC1R_RSTN_Msk SDMMC_MC1R_RSTN_Msk
#define SDHC_MC1R_RSTN(value) SDMMC_MC1R_RSTN(value)
#define SDHC_MC1R_FCD_Pos SDMMC_MC1R_FCD_Pos
#define SDHC_MC1R_FCD_Msk SDMMC_MC1R_FCD_Msk
#define SDHC_MC1R_FCD(value) SDMMC_MC1R_FCD(value)
#define SDHC_MC1R_Msk SDMMC_MC1R_Msk

/* SDHC_MC2R : (SDMMC Offset: 0x205) ( /W 8) e.MMC Control 2 */
#define SDHC_MC2R_RESETVALUE SDMMC_MC2R_RESETVALUE

#define SDHC_MC2R_SRESP_Pos SDMMC_MC2R_SRESP_Pos
#define SDHC_MC2R_SRESP_Msk SDMMC_MC2R_SRESP_Msk
#define SDHC_MC2R_SRESP(value) SDMMC_MC2R_SRESP(value)
#define SDHC_MC2R_ABOOT_Pos SDMMC_MC2R_ABOOT_Pos
#define SDHC_MC2R_ABOOT_Msk SDMMC_MC2R_ABOOT_Msk
#define SDHC_MC2R_ABOOT(value) SDMMC_MC2R_ABOOT(value)
#define SDHC_MC2R_Msk SDMMC_MC2R_Msk

/* SDHC_DEBR : (SDMMC Offset: 0x207) (R/W 8) Debounce Register */
#define SDHC_DEBR_RESETVALUE SDMMC_DEBR_RESETVALUE

#define SDHC_DEBR_CDDVAL_Pos SDMMC_DEBR_CDDVAL_Pos
#define SDHC_DEBR_CDDVAL_Msk SDMMC_DEBR_CDDVAL_Msk
#define SDHC_DEBR_CDDVAL(value) SDMMC_DEBR_CDDVAL(value)
#define SDHC_DEBR_CDDVAL_1CYCLE_Val SDMMC_DEBR_CDDVAL_1CYCLE_Val
#define SDHC_DEBR_CDDVAL_8CYCLES_Val SDMMC_DEBR_CDDVAL_8CYCLES_Val
#define SDHC_DEBR_CDDVAL_33CYCLES_Val SDMMC_DEBR_CDDVAL_33CYCLES_Val
#define SDHC_DEBR_CDDVAL_328CYCLES_Val SDMMC_DEBR_CDDVAL_328CYCLES_Val
#define SDHC_DEBR_CDDVAL_1CYCLE SDMMC_DEBR_CDDVAL_1CYCLE
#define SDHC_DEBR_CDDVAL_8CYCLES SDMMC_DEBR_CDDVAL_8CYCLES
#define SDHC_DEBR_CDDVAL_33CYCLES SDMMC_DEBR_CDDVAL_33CYCLES
#define SDHC_DEBR_CDDVAL_328CYCLES SDMMC_DEBR_CDDVAL_328CYCLES
#define SDHC_DEBR_Msk SDMMC_DEBR_Msk

/* SDHC_ACR : (SDMMC Offset: 0x208) (R/W 32) AHB Control */
#define SDHC_ACR_RESETVALUE SDMMC_ACR_RESETVALUE

#define SDHC_ACR_BMAX_Pos SDMMC_ACR_BMAX_Pos
#define SDHC_ACR_BMAX_Msk SDMMC_ACR_BMAX_Msk
#define SDHC_ACR_BMAX(value) SDMMC_ACR_BMAX(value)
#define SDHC_ACR_BMAX_INCR16_Val SDMMC_ACR_BMAX_INCR16_Val
#define SDHC_ACR_BMAX_INCR8_Val SDMMC_ACR_BMAX_INCR8_Val
#define SDHC_ACR_BMAX_INCR4_Val SDMMC_ACR_BMAX_INCR4_Val
#define SDHC_ACR_BMAX_SINGLE_Val SDMMC_ACR_BMAX_SINGLE_Val
#define SDHC_ACR_BMAX_INCR16 SDMMC_ACR_BMAX_INCR16
#define SDHC_ACR_BMAX_INCR8 SDMMC_ACR_BMAX_INCR8
#define SDHC_ACR_BMAX_INCR4 SDMMC_ACR_BMAX_INCR4
#define SDHC_ACR_BMAX_SINGLE SDMMC_ACR_BMAX_SINGLE
#define SDHC_ACR_Msk SDMMC_ACR_Msk

/* SDHC_CC2R : (SDMMC Offset: 0x20C) (R/W 32) Clock Control 2 */
#define SDHC_CC2R_RESETVALUE SDMMC_CC2R_RESETVALUE

#define SDHC_CC2R_FSDCLKD_Pos SDMMC_CC2R_FSDCLKD_Pos
#define SDHC_CC2R_FSDCLKD_Msk SDMMC_CC2R_FSDCLKD_Msk
#define SDHC_CC2R_FSDCLKD(value) SDMMC_CC2R_FSDCLKD(value)
#define SDHC_CC2R_FSDCLKD_NOEFFECT_Val SDMMC_CC2R_FSDCLKD_NOEFFECT_Val
#define SDHC_CC2R_FSDCLKD_DISABLE_Val SDMMC_CC2R_FSDCLKD_DISABLE_Val
#define SDHC_CC2R_FSDCLKD_NOEFFECT SDMMC_CC2R_FSDCLKD_NOEFFECT
#define SDHC_CC2R_FSDCLKD_DISABLE SDMMC_CC2R_FSDCLKD_DISABLE
#define SDHC_CC2R_Msk SDMMC_CC2R_Msk

/* SDHC_CACR : (SDMMC Offset: 0x230) (R/W 32) Capabilities Control */
#define SDHC_CACR_RESETVALUE SDMMC_CACR_RESETVALUE

#define SDHC_CACR_CAPWREN_Pos SDMMC_CACR_CAPWREN_Pos
#define SDHC_CACR_CAPWREN_Msk SDMMC_CACR_CAPWREN_Msk
#define SDHC_CACR_CAPWREN(value) SDMMC_CACR_CAPWREN(value)
#define SDHC_CACR_KEY_Pos SDMMC_CACR_KEY_Pos
#define SDHC_CACR_KEY_Msk SDMMC_CACR_KEY_Msk
#define SDHC_CACR_KEY(value) SDMMC_CACR_KEY(value)
#define SDHC_CACR_Msk SDMMC_CACR_Msk

/* SDHC_DBGR : (SDMMC Offset: 0x234) (R/W 32) Debug */
#define SDHC_DBGR_RESETVALUE SDMMC_DBGR_RESETVALUE

#define SDHC_DBGR_NIDBG_Pos SDMMC_DBGR_NIDBG_Pos
#define SDHC_DBGR_NIDBG_Msk SDMMC_DBGR_NIDBG_Msk
#define SDHC_DBGR_NIDBG(value) SDMMC_DBGR_NIDBG(value)
#define SDHC_DBGR_NIDBG_IDBG_Val SDMMC_DBGR_NIDBG_IDBG_Val
#define SDHC_DBGR_NIDBG_NIDBG_Val SDMMC_DBGR_NIDBG_NIDBG_Val
#define SDHC_DBGR_NIDBG_IDBG SDMMC_DBGR_NIDBG_IDBG
#define SDHC_DBGR_NIDBG_NIDBG SDMMC_DBGR_NIDBG_NIDBG
#define SDHC_DBGR_Msk SDMMC_DBGR_Msk

/* SDMMC register offsets definitions */
#define SDHC_SSAR_REG_OFST SDMMC_SSAR_REG_OFST
#define SDHC_BSR_REG_OFST SDMMC_BSR_REG_OFST
#define SDHC_BCR_REG_OFST SDMMC_BCR_REG_OFST
#define SDHC_ARG1R_REG_OFST SDMMC_ARG1R_REG_OFST
#define SDHC_TMR_REG_OFST SDMMC_TMR_REG_OFST
#define SDHC_CR_REG_OFST SDMMC_CR_REG_OFST
#define SDHC_RR_REG_OFST SDMMC_RR_REG_OFST
#define SDHC_RR0_REG_OFST SDMMC_RR0_REG_OFST
#define SDHC_RR1_REG_OFST SDMMC_RR1_REG_OFST
#define SDHC_RR2_REG_OFST SDMMC_RR2_REG_OFST
#define SDHC_RR3_REG_OFST SDMMC_RR3_REG_OFST
#define SDHC_BDPR_REG_OFST SDMMC_BDPR_REG_OFST
#define SDHC_PSR_REG_OFST SDMMC_PSR_REG_OFST
#define SDHC_HC1R_REG_OFST SDMMC_HC1R_REG_OFST
#define SDHC_PCR_REG_OFST SDMMC_PCR_REG_OFST
#define SDHC_BGCR_REG_OFST SDMMC_BGCR_REG_OFST
#define SDHC_WCR_REG_OFST SDMMC_WCR_REG_OFST
#define SDHC_CCR_REG_OFST SDMMC_CCR_REG_OFST
#define SDHC_TCR_REG_OFST SDMMC_TCR_REG_OFST
#define SDHC_SRR_REG_OFST SDMMC_SRR_REG_OFST
#define SDHC_NISTR_REG_OFST SDMMC_NISTR_REG_OFST
#define SDHC_EISTR_REG_OFST SDMMC_EISTR_REG_OFST
#define SDHC_NISTER_REG_OFST SDMMC_NISTER_REG_OFST
#define SDHC_EISTER_REG_OFST SDMMC_EISTER_REG_OFST
#define SDHC_NISIER_REG_OFST SDMMC_NISIER_REG_OFST
#define SDHC_EISIER_REG_OFST SDMMC_EISIER_REG_OFST
#define SDHC_ACESR_REG_OFST SDMMC_ACESR_REG_OFST
#define SDHC_HC2R_REG_OFST SDMMC_HC2R_REG_OFST
#define SDHC_CA0R_REG_OFST SDMMC_CA0R_REG_OFST
#define SDHC_CA1R_REG_OFST SDMMC_CA1R_REG_OFST
#define SDHC_MCCAR_REG_OFST SDMMC_MCCAR_REG_OFST
#define SDHC_FERACES_REG_OFST SDMMC_FERACES_REG_OFST
#define SDHC_FEREIS_REG_OFST SDMMC_FEREIS_REG_OFST
#define SDHC_AESR_REG_OFST SDMMC_AESR_REG_OFST
#define SDHC_ASAR_REG_OFST SDMMC_ASAR_REG_OFST
#define SDHC_PVR_REG_OFST SDMMC_PVR_REG_OFST
#define SDHC_PVR0_REG_OFST SDMMC_PVR0_REG_OFST
#define SDHC_PVR1_REG_OFST SDMMC_PVR1_REG_OFST
#define SDHC_PVR2_REG_OFST SDMMC_PVR2_REG_OFST
#define SDHC_SISR_REG_OFST SDMMC_SISR_REG_OFST
#define SDHC_HCVR_REG_OFST SDMMC_HCVR_REG_OFST
#define SDHC_MC1R_REG_OFST SDMMC_MC1R_REG_OFST
#define SDHC_MC2R_REG_OFST SDMMC_MC2R_REG_OFST
#define SDHC_DEBR_REG_OFST SDMMC_DEBR_REG_OFST
#define SDHC_ACR_REG_OFST SDMMC_ACR_REG_OFST
#define SDHC_CC2R_REG_OFST SDMMC_CC2R_REG_OFST
#define SDHC_CACR_REG_OFST SDMMC_CACR_REG_OFST
#define SDHC_DBGR_REG_OFST SDMMC_DBGR_REG_OFST

/* Register struct member name mappings (SDHC_ -> SDMMC_) */
#define SDHC_SSAR SDMMC_SSAR
#define SDHC_BSR SDMMC_BSR
#define SDHC_BCR SDMMC_BCR
#define SDHC_ARG1R SDMMC_ARG1R
#define SDHC_TMR SDMMC_TMR
#define SDHC_CR SDMMC_CR
#define SDHC_RR SDMMC_RR
#define SDHC_BDPR SDMMC_BDPR
#define SDHC_PSR SDMMC_PSR
#define SDHC_HC1R SDMMC_HC1R
#define SDHC_PCR SDMMC_PCR
#define SDHC_BGCR SDMMC_BGCR
#define SDHC_WCR SDMMC_WCR
#define SDHC_CCR SDMMC_CCR
#define SDHC_TCR SDMMC_TCR
#define SDHC_SRR SDMMC_SRR
#define SDHC_NISTR SDMMC_NISTR
#define SDHC_EISTR SDMMC_EISTR
#define SDHC_NISTER SDMMC_NISTER
#define SDHC_EISTER SDMMC_EISTER
#define SDHC_NISIER SDMMC_NISIER
#define SDHC_EISIER SDMMC_EISIER
#define SDHC_ACESR SDMMC_ACESR
#define SDHC_HC2R SDMMC_HC2R
#define SDHC_CA0R SDMMC_CA0R
#define SDHC_CA1R SDMMC_CA1R
#define SDHC_MCCAR SDMMC_MCCAR
#define SDHC_FERACES SDMMC_FERACES
#define SDHC_FEREIS SDMMC_FEREIS
#define SDHC_AESR SDMMC_AESR
#define SDHC_ASAR SDMMC_ASAR
#define SDHC_PVR SDMMC_PVR
#define SDHC_SISR SDMMC_SISR
#define SDHC_HCVR SDMMC_HCVR
#define SDHC_MC1R SDMMC_MC1R
#define SDHC_MC2R SDMMC_MC2R
#define SDHC_DEBR SDMMC_DEBR
#define SDHC_ACR SDMMC_ACR
#define SDHC_CC2R SDMMC_CC2R
#define SDHC_CACR SDMMC_CACR
#define SDHC_DBGR SDMMC_DBGR

#endif /* MICROCHIP_COMMON_SDHC_PIC32CK_SG_GC_H_ */
